module @IrToHlo.6869 attributes {mhlo.cross_program_prefetches = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<32000x4096xf32>, %arg1: tensor<4096xf32>, %arg2: tensor<f32>, %arg3: tensor<4096x11008xf32>, %arg4: tensor<11008x4096xf32>, %arg5: tensor<4096xf32>, %arg6: tensor<4096x4096xf32>, %arg7: tensor<2049xi64>, %arg8: tensor<4096x4096xf32>, %arg9: tensor<4096xf32>, %arg10: tensor<4096x11008xf32>, %arg11: tensor<11008x4096xf32>, %arg12: tensor<4096xf32>, %arg13: tensor<4096x4096xf32>, %arg14: tensor<4096x4096xf32>, %arg15: tensor<4096xf32>, %arg16: tensor<4096x11008xf32>, %arg17: tensor<11008x4096xf32>, %arg18: tensor<4096xf32>, %arg19: tensor<4096x4096xf32>, %arg20: tensor<4096x4096xf32>, %arg21: tensor<4096xf32>, %arg22: tensor<4096x11008xf32>, %arg23: tensor<11008x4096xf32>, %arg24: tensor<4096xf32>, %arg25: tensor<4096x4096xf32>, %arg26: tensor<4096x4096xf32>, %arg27: tensor<4096xf32>, %arg28: tensor<4096x11008xf32>, %arg29: tensor<11008x4096xf32>, %arg30: tensor<4096xf32>, %arg31: tensor<4096x4096xf32>, %arg32: tensor<4096x4096xf32>, %arg33: tensor<4096xf32>, %arg34: tensor<4096x11008xf32>, %arg35: tensor<11008x4096xf32>, %arg36: tensor<4096xf32>, %arg37: tensor<4096x4096xf32>, %arg38: tensor<4096x4096xf32>, %arg39: tensor<4096xf32>, %arg40: tensor<4096x11008xf32>, %arg41: tensor<11008x4096xf32>, %arg42: tensor<4096xf32>, %arg43: tensor<4096x4096xf32>, %arg44: tensor<4096x4096xf32>, %arg45: tensor<4096xf32>, %arg46: tensor<4096x11008xf32>, %arg47: tensor<11008x4096xf32>, %arg48: tensor<4096xf32>, %arg49: tensor<4096x4096xf32>, %arg50: tensor<4096x4096xf32>, %arg51: tensor<4096xf32>, %arg52: tensor<4096x11008xf32>, %arg53: tensor<11008x4096xf32>, %arg54: tensor<4096xf32>, %arg55: tensor<4096x4096xf32>, %arg56: tensor<4096x4096xf32>, %arg57: tensor<4096xf32>, %arg58: tensor<4096x11008xf32>, %arg59: tensor<11008x4096xf32>, %arg60: tensor<4096xf32>, %arg61: tensor<4096x4096xf32>, %arg62: tensor<4096x4096xf32>, %arg63: tensor<4096xf32>, %arg64: tensor<4096x11008xf32>, %arg65: tensor<11008x4096xf32>, %arg66: tensor<4096xf32>, %arg67: tensor<4096x4096xf32>, %arg68: tensor<4096x4096xf32>, %arg69: tensor<4096xf32>, %arg70: tensor<4096x11008xf32>, %arg71: tensor<11008x4096xf32>, %arg72: tensor<4096xf32>, %arg73: tensor<4096x4096xf32>, %arg74: tensor<4096x4096xf32>, %arg75: tensor<4096xf32>, %arg76: tensor<4096x11008xf32>, %arg77: tensor<11008x4096xf32>, %arg78: tensor<4096xf32>, %arg79: tensor<4096x4096xf32>, %arg80: tensor<4096x4096xf32>, %arg81: tensor<4096xf32>, %arg82: tensor<4096x11008xf32>, %arg83: tensor<11008x4096xf32>, %arg84: tensor<4096xf32>, %arg85: tensor<4096x4096xf32>, %arg86: tensor<4096x4096xf32>, %arg87: tensor<4096xf32>, %arg88: tensor<4096x11008xf32>, %arg89: tensor<11008x4096xf32>, %arg90: tensor<4096xf32>, %arg91: tensor<4096x4096xf32>, %arg92: tensor<4096x4096xf32>, %arg93: tensor<4096xf32>, %arg94: tensor<4096x11008xf32>, %arg95: tensor<11008x4096xf32>, %arg96: tensor<4096xf32>, %arg97: tensor<4096x4096xf32>, %arg98: tensor<4096x4096xf32>, %arg99: tensor<4096xf32>, %arg100: tensor<4096x11008xf32>, %arg101: tensor<11008x4096xf32>, %arg102: tensor<4096xf32>, %arg103: tensor<4096x4096xf32>, %arg104: tensor<4096x4096xf32>, %arg105: tensor<4096xf32>, %arg106: tensor<4096x11008xf32>, %arg107: tensor<11008x4096xf32>, %arg108: tensor<4096xf32>, %arg109: tensor<4096x4096xf32>, %arg110: tensor<4096x4096xf32>, %arg111: tensor<4096xf32>, %arg112: tensor<4096x11008xf32>, %arg113: tensor<11008x4096xf32>, %arg114: tensor<4096xf32>, %arg115: tensor<4096x4096xf32>, %arg116: tensor<4096x4096xf32>, %arg117: tensor<4096xf32>, %arg118: tensor<4096x11008xf32>, %arg119: tensor<11008x4096xf32>, %arg120: tensor<4096xf32>, %arg121: tensor<4096x4096xf32>, %arg122: tensor<4096x4096xf32>, %arg123: tensor<4096xf32>, %arg124: tensor<4096x11008xf32>, %arg125: tensor<11008x4096xf32>, %arg126: tensor<4096xf32>, %arg127: tensor<4096x4096xf32>, %arg128: tensor<4096x4096xf32>, %arg129: tensor<4096xf32>, %arg130: tensor<4096x11008xf32>, %arg131: tensor<11008x4096xf32>, %arg132: tensor<4096xf32>, %arg133: tensor<4096x4096xf32>, %arg134: tensor<4096x4096xf32>, %arg135: tensor<4096xf32>, %arg136: tensor<4096x11008xf32>, %arg137: tensor<11008x4096xf32>, %arg138: tensor<4096xf32>, %arg139: tensor<4096x4096xf32>, %arg140: tensor<4096x4096xf32>, %arg141: tensor<4096xf32>, %arg142: tensor<4096x11008xf32>, %arg143: tensor<11008x4096xf32>, %arg144: tensor<4096xf32>, %arg145: tensor<4096x4096xf32>, %arg146: tensor<4096x4096xf32>, %arg147: tensor<4096xf32>, %arg148: tensor<4096x11008xf32>, %arg149: tensor<11008x4096xf32>, %arg150: tensor<4096xf32>, %arg151: tensor<4096x4096xf32>, %arg152: tensor<4096x4096xf32>, %arg153: tensor<4096xf32>, %arg154: tensor<4096x11008xf32>, %arg155: tensor<11008x4096xf32>, %arg156: tensor<4096xf32>, %arg157: tensor<4096x4096xf32>, %arg158: tensor<4096x4096xf32>, %arg159: tensor<4096xf32>, %arg160: tensor<4096x11008xf32>, %arg161: tensor<11008x4096xf32>, %arg162: tensor<4096xf32>, %arg163: tensor<4096x4096xf32>, %arg164: tensor<4096x4096xf32>, %arg165: tensor<4096xf32>, %arg166: tensor<4096x11008xf32>, %arg167: tensor<11008x4096xf32>, %arg168: tensor<4096xf32>, %arg169: tensor<4096x4096xf32>, %arg170: tensor<4096x4096xf32>, %arg171: tensor<4096xf32>, %arg172: tensor<4096x11008xf32>, %arg173: tensor<11008x4096xf32>, %arg174: tensor<4096xf32>, %arg175: tensor<4096x4096xf32>, %arg176: tensor<4096x4096xf32>, %arg177: tensor<4096xf32>, %arg178: tensor<4096x11008xf32>, %arg179: tensor<11008x4096xf32>, %arg180: tensor<4096xf32>, %arg181: tensor<4096x4096xf32>, %arg182: tensor<4096x4096xf32>, %arg183: tensor<4096xf32>, %arg184: tensor<4096x11008xf32>, %arg185: tensor<11008x4096xf32>, %arg186: tensor<4096xf32>, %arg187: tensor<4096x4096xf32>, %arg188: tensor<4096x4096xf32>, %arg189: tensor<4096xf32>, %arg190: tensor<4096x11008xf32>, %arg191: tensor<11008x4096xf32>, %arg192: tensor<4096xf32>, %arg193: tensor<4096x4096xf32>, %arg194: tensor<4096x4096xf32>, %arg195: tensor<4096xf32>, %arg196: tensor<1xi64>, %arg197: tensor<32000x4096xf32>, %arg198: tensor<1xi64>, %arg199: tensor<i64>, %arg200: tensor<2304x32x128xf32>, %arg201: tensor<f32>, %arg202: tensor<4608x64xcomplex<f32>>, %arg203: tensor<4096x4096xf32>, %arg204: tensor<2304x32x128xf32>, %arg205: tensor<4096x4096xf32>, %arg206: tensor<11008x4096xf32>, %arg207: tensor<2304x32x128xf32>, %arg208: tensor<4096x4096xf32>, %arg209: tensor<2304x32x128xf32>, %arg210: tensor<4096x4096xf32>, %arg211: tensor<11008x4096xf32>, %arg212: tensor<2304x32x128xf32>, %arg213: tensor<4096x4096xf32>, %arg214: tensor<2304x32x128xf32>, %arg215: tensor<4096x4096xf32>, %arg216: tensor<11008x4096xf32>, %arg217: tensor<2304x32x128xf32>, %arg218: tensor<4096x4096xf32>, %arg219: tensor<2304x32x128xf32>, %arg220: tensor<4096x4096xf32>, %arg221: tensor<11008x4096xf32>, %arg222: tensor<2304x32x128xf32>, %arg223: tensor<4096x4096xf32>, %arg224: tensor<2304x32x128xf32>, %arg225: tensor<4096x4096xf32>, %arg226: tensor<11008x4096xf32>, %arg227: tensor<2304x32x128xf32>, %arg228: tensor<4096x4096xf32>, %arg229: tensor<2304x32x128xf32>, %arg230: tensor<4096x4096xf32>, %arg231: tensor<11008x4096xf32>, %arg232: tensor<2304x32x128xf32>, %arg233: tensor<4096x4096xf32>, %arg234: tensor<2304x32x128xf32>, %arg235: tensor<4096x4096xf32>, %arg236: tensor<11008x4096xf32>, %arg237: tensor<2304x32x128xf32>, %arg238: tensor<4096x4096xf32>, %arg239: tensor<2304x32x128xf32>, %arg240: tensor<4096x4096xf32>, %arg241: tensor<11008x4096xf32>, %arg242: tensor<2304x32x128xf32>, %arg243: tensor<4096x4096xf32>, %arg244: tensor<2304x32x128xf32>, %arg245: tensor<4096x4096xf32>, %arg246: tensor<11008x4096xf32>, %arg247: tensor<2304x32x128xf32>, %arg248: tensor<4096x4096xf32>, %arg249: tensor<2304x32x128xf32>, %arg250: tensor<4096x4096xf32>, %arg251: tensor<11008x4096xf32>, %arg252: tensor<2304x32x128xf32>, %arg253: tensor<4096x4096xf32>, %arg254: tensor<2304x32x128xf32>, %arg255: tensor<4096x4096xf32>, %arg256: tensor<11008x4096xf32>, %arg257: tensor<2304x32x128xf32>, %arg258: tensor<4096x4096xf32>, %arg259: tensor<2304x32x128xf32>, %arg260: tensor<4096x4096xf32>, %arg261: tensor<11008x4096xf32>, %arg262: tensor<2304x32x128xf32>, %arg263: tensor<4096x4096xf32>, %arg264: tensor<2304x32x128xf32>, %arg265: tensor<4096x4096xf32>, %arg266: tensor<11008x4096xf32>, %arg267: tensor<2304x32x128xf32>, %arg268: tensor<4096x4096xf32>, %arg269: tensor<2304x32x128xf32>, %arg270: tensor<4096x4096xf32>, %arg271: tensor<11008x4096xf32>, %arg272: tensor<2304x32x128xf32>, %arg273: tensor<4096x4096xf32>, %arg274: tensor<2304x32x128xf32>, %arg275: tensor<4096x4096xf32>, %arg276: tensor<11008x4096xf32>, %arg277: tensor<2304x32x128xf32>, %arg278: tensor<4096x4096xf32>, %arg279: tensor<2304x32x128xf32>, %arg280: tensor<4096x4096xf32>, %arg281: tensor<11008x4096xf32>, %arg282: tensor<2304x32x128xf32>, %arg283: tensor<4096x4096xf32>, %arg284: tensor<2304x32x128xf32>, %arg285: tensor<4096x4096xf32>, %arg286: tensor<11008x4096xf32>, %arg287: tensor<2304x32x128xf32>, %arg288: tensor<4096x4096xf32>, %arg289: tensor<2304x32x128xf32>, %arg290: tensor<4096x4096xf32>, %arg291: tensor<11008x4096xf32>, %arg292: tensor<2304x32x128xf32>, %arg293: tensor<4096x4096xf32>, %arg294: tensor<2304x32x128xf32>, %arg295: tensor<4096x4096xf32>, %arg296: tensor<11008x4096xf32>, %arg297: tensor<2304x32x128xf32>, %arg298: tensor<4096x4096xf32>, %arg299: tensor<2304x32x128xf32>, %arg300: tensor<4096x4096xf32>, %arg301: tensor<11008x4096xf32>, %arg302: tensor<2304x32x128xf32>, %arg303: tensor<4096x4096xf32>, %arg304: tensor<2304x32x128xf32>, %arg305: tensor<4096x4096xf32>, %arg306: tensor<11008x4096xf32>, %arg307: tensor<2304x32x128xf32>, %arg308: tensor<4096x4096xf32>, %arg309: tensor<2304x32x128xf32>, %arg310: tensor<4096x4096xf32>, %arg311: tensor<11008x4096xf32>, %arg312: tensor<2304x32x128xf32>, %arg313: tensor<4096x4096xf32>, %arg314: tensor<2304x32x128xf32>, %arg315: tensor<4096x4096xf32>, %arg316: tensor<11008x4096xf32>, %arg317: tensor<2304x32x128xf32>, %arg318: tensor<4096x4096xf32>, %arg319: tensor<2304x32x128xf32>, %arg320: tensor<4096x4096xf32>, %arg321: tensor<11008x4096xf32>, %arg322: tensor<2304x32x128xf32>, %arg323: tensor<4096x4096xf32>, %arg324: tensor<2304x32x128xf32>, %arg325: tensor<4096x4096xf32>, %arg326: tensor<11008x4096xf32>, %arg327: tensor<2304x32x128xf32>, %arg328: tensor<4096x4096xf32>, %arg329: tensor<2304x32x128xf32>, %arg330: tensor<4096x4096xf32>, %arg331: tensor<11008x4096xf32>, %arg332: tensor<2304x32x128xf32>, %arg333: tensor<4096x4096xf32>, %arg334: tensor<2304x32x128xf32>, %arg335: tensor<4096x4096xf32>, %arg336: tensor<11008x4096xf32>, %arg337: tensor<2304x32x128xf32>, %arg338: tensor<4096x4096xf32>, %arg339: tensor<2304x32x128xf32>, %arg340: tensor<4096x4096xf32>, %arg341: tensor<11008x4096xf32>, %arg342: tensor<2304x32x128xf32>, %arg343: tensor<4096x4096xf32>, %arg344: tensor<2304x32x128xf32>, %arg345: tensor<4096x4096xf32>, %arg346: tensor<11008x4096xf32>, %arg347: tensor<2304x32x128xf32>, %arg348: tensor<4096x4096xf32>, %arg349: tensor<2304x32x128xf32>, %arg350: tensor<4096x4096xf32>, %arg351: tensor<11008x4096xf32>, %arg352: tensor<2304x32x128xf32>, %arg353: tensor<4096x4096xf32>, %arg354: tensor<2304x32x128xf32>, %arg355: tensor<4096x4096xf32>, %arg356: tensor<11008x4096xf32>, %arg357: tensor<2304x32x128xf32>, %arg358: tensor<4096x4096xf32>, %arg359: tensor<2304x32x128xf32>, %arg360: tensor<4096x4096xf32>, %arg361: tensor<11008x4096xf32>) -> (tensor<1x32000xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>, tensor<2304x32x128xf32>) {
    %0 = stablehlo.constant dense<2.44140625E-4> : tensor<1xf32>
    %1 = stablehlo.constant dense<2.000000e+00> : tensor<1x4096xf32>
    %2 = stablehlo.constant dense<0> : tensor<1xi64>
    %3 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %4 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %5 = stablehlo.convert %arg196 : (tensor<1xi64>) -> tensor<1xui32>
    %6 = "stablehlo.gather"(%arg197, %5) {dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 4096]> : tensor<2xi64>} : (tensor<32000x4096xf32>, tensor<1xui32>) -> tensor<1x4096xf32>
    %7 = stablehlo.power %6, %1 : tensor<1x4096xf32>
    %8 = stablehlo.reduce(%7 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %9 = stablehlo.multiply %8, %0 : tensor<1xf32>
    %10 = stablehlo.reshape %9 : (tensor<1xf32>) -> tensor<1x1xf32>
    %11 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %12 = stablehlo.add %10, %11 : tensor<1x1xf32>
    %13 = stablehlo.rsqrt %12 : tensor<1x1xf32>
    %14 = stablehlo.reshape %13 : (tensor<1x1xf32>) -> tensor<1xf32>
    %15 = stablehlo.broadcast_in_dim %14, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %16 = stablehlo.multiply %6, %15 : tensor<1x4096xf32>
    %17 = stablehlo.reshape %arg195 : (tensor<4096xf32>) -> tensor<1x4096xf32>
    %18 = stablehlo.multiply %16, %17 : tensor<1x4096xf32>
    %19 = stablehlo.transpose %arg205, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %20 = stablehlo.dot %18, %19, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %21 = stablehlo.reshape %20 : (tensor<1x4096xf32>) -> tensor<1x32x64x2xf32>
    %22 = stablehlo.slice %21 [0:1, 0:32, 0:64, 0:1] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %23 = stablehlo.reshape %22 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %24 = stablehlo.slice %21 [0:1, 0:32, 0:64, 1:2] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %25 = stablehlo.reshape %24 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %26 = stablehlo.complex %23, %25 : tensor<1x32x64xcomplex<f32>>
    %27 = stablehlo.convert %arg198 : (tensor<1xi64>) -> tensor<1xui32>
    %28 = "stablehlo.gather"(%arg202, %27) {dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 64]> : tensor<2xi64>} : (tensor<4608x64xcomplex<f32>>, tensor<1xui32>) -> tensor<1x64xcomplex<f32>>
    %29 = stablehlo.broadcast_in_dim %28, dims = [0, 2] : (tensor<1x64xcomplex<f32>>) -> tensor<1x32x64xcomplex<f32>>
    %30 = stablehlo.multiply %26, %29 : tensor<1x32x64xcomplex<f32>>
    %31 = stablehlo.real %30 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %32 = stablehlo.reshape %31 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %33 = stablehlo.imag %30 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %34 = stablehlo.reshape %33 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %35 = stablehlo.concatenate %32, %34, dim = 3 : (tensor<1x32x64x1xf32>, tensor<1x32x64x1xf32>) -> tensor<1x32x64x2xf32>
    %36 = stablehlo.reshape %35 : (tensor<1x32x64x2xf32>) -> tensor<32x1x128xf32>
    %37 = stablehlo.compare  LT, %arg198, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %38 = stablehlo.reshape %arg199 : (tensor<i64>) -> tensor<1xi64>
    %39 = stablehlo.add %arg198, %38 : tensor<1xi64>
    %40 = stablehlo.select %37, %39, %arg198 : tensor<1xi1>, tensor<1xi64>
    %41 = stablehlo.reshape %40 : (tensor<1xi64>) -> tensor<1x1xi64>
    %42 = stablehlo.transpose %arg203, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %43 = stablehlo.dot %18, %42, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %44 = stablehlo.reshape %43 : (tensor<1x4096xf32>) -> tensor<1x32x64x2xf32>
    %45 = stablehlo.slice %44 [0:1, 0:32, 0:64, 0:1] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %46 = stablehlo.reshape %45 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %47 = stablehlo.slice %44 [0:1, 0:32, 0:64, 1:2] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %48 = stablehlo.reshape %47 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %49 = stablehlo.complex %46, %48 : tensor<1x32x64xcomplex<f32>>
    %50 = stablehlo.broadcast_in_dim %28, dims = [0, 2] : (tensor<1x64xcomplex<f32>>) -> tensor<1x32x64xcomplex<f32>>
    %51 = stablehlo.multiply %49, %50 : tensor<1x32x64xcomplex<f32>>
    %52 = stablehlo.real %51 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %53 = stablehlo.reshape %52 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %54 = stablehlo.imag %51 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %55 = stablehlo.reshape %54 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %56 = stablehlo.concatenate %53, %55, dim = 3 : (tensor<1x32x64x1xf32>, tensor<1x32x64x1xf32>) -> tensor<1x32x64x2xf32>
    %57 = stablehlo.reshape %56 : (tensor<1x32x64x2xf32>) -> tensor<1x32x128xf32>
    %58 = "stablehlo.scatter"(%arg204, %41, %57) ({
    ^bb0(%arg362: tensor<f32>, %arg363: tensor<f32>):
      stablehlo.return %arg363 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [1, 2], inserted_window_dims = [0], scatter_dims_to_operand_dims = [0], index_vector_dim = 1>, unique_indices = false} : (tensor<2304x32x128xf32>, tensor<1x1xi64>, tensor<1x32x128xf32>) -> tensor<2304x32x128xf32>
    %59 = stablehlo.convert %arg7 : (tensor<2049xi64>) -> tensor<2049xui32>
    %60 = "stablehlo.gather"(%58, %59) {dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 32, 128]> : tensor<3xi64>} : (tensor<2304x32x128xf32>, tensor<2049xui32>) -> tensor<2049x32x128xf32>
    %61 = stablehlo.transpose %60, dims = [1, 2, 0] : (tensor<2049x32x128xf32>) -> tensor<32x128x2049xf32>
    %62 = stablehlo.dot_general %36, %61, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<32x1x128xf32>, tensor<32x128x2049xf32>) -> tensor<32x1x2049xf32>
    %63 = stablehlo.broadcast_in_dim %arg201, dims = [] : (tensor<f32>) -> tensor<32x1x2049xf32>
    %64 = stablehlo.divide %62, %63 : tensor<32x1x2049xf32>
    %65 = stablehlo.reduce(%64 init: %3) across dimensions = [2] : (tensor<32x1x2049xf32>, tensor<f32>) -> tensor<32x1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.maximum %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %66 = stablehlo.broadcast_in_dim %65, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x2049xf32>
    %67 = stablehlo.subtract %64, %66 : tensor<32x1x2049xf32>
    %68 = stablehlo.exponential %67 : tensor<32x1x2049xf32>
    %69 = stablehlo.reduce(%68 init: %4) across dimensions = [2] : (tensor<32x1x2049xf32>, tensor<f32>) -> tensor<32x1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %70 = stablehlo.broadcast_in_dim %69, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x2049xf32>
    %71 = stablehlo.divide %68, %70 : tensor<32x1x2049xf32>
    %72 = stablehlo.compare  LT, %arg198, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %73 = stablehlo.reshape %arg199 : (tensor<i64>) -> tensor<1xi64>
    %74 = stablehlo.add %arg198, %73 : tensor<1xi64>
    %75 = stablehlo.select %72, %74, %arg198 : tensor<1xi1>, tensor<1xi64>
    %76 = stablehlo.reshape %75 : (tensor<1xi64>) -> tensor<1x1xi64>
    %77 = stablehlo.transpose %arg194, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %78 = stablehlo.dot %18, %77, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %79 = stablehlo.reshape %78 : (tensor<1x4096xf32>) -> tensor<1x32x128xf32>
    %80 = "stablehlo.scatter"(%arg200, %76, %79) ({
    ^bb0(%arg362: tensor<f32>, %arg363: tensor<f32>):
      stablehlo.return %arg363 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [1, 2], inserted_window_dims = [0], scatter_dims_to_operand_dims = [0], index_vector_dim = 1>, unique_indices = false} : (tensor<2304x32x128xf32>, tensor<1x1xi64>, tensor<1x32x128xf32>) -> tensor<2304x32x128xf32>
    %81 = stablehlo.convert %arg7 : (tensor<2049xi64>) -> tensor<2049xui32>
    %82 = "stablehlo.gather"(%80, %81) {dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 32, 128]> : tensor<3xi64>} : (tensor<2304x32x128xf32>, tensor<2049xui32>) -> tensor<2049x32x128xf32>
    %83 = stablehlo.transpose %82, dims = [1, 0, 2] {result_layout = dense<[2, 0, 1]> : tensor<3xindex>, xla_shape = "f32[32,2049,128]{2,0,1}"} : (tensor<2049x32x128xf32>) -> tensor<32x2049x128xf32>
    %84 = stablehlo.dot_general %71, %83, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<32x1x2049xf32>, tensor<32x2049x128xf32>) -> tensor<32x1x128xf32>
    %85 = stablehlo.reshape %84 : (tensor<32x1x128xf32>) -> tensor<1x4096xf32>
    %86 = stablehlo.transpose %arg193, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %87 = stablehlo.dot %85, %86, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %88 = stablehlo.add %6, %87 : tensor<1x4096xf32>
    %89 = stablehlo.power %88, %1 : tensor<1x4096xf32>
    %90 = stablehlo.reduce(%89 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %91 = stablehlo.multiply %90, %0 : tensor<1xf32>
    %92 = stablehlo.reshape %91 : (tensor<1xf32>) -> tensor<1x1xf32>
    %93 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %94 = stablehlo.add %92, %93 : tensor<1x1xf32>
    %95 = stablehlo.rsqrt %94 : tensor<1x1xf32>
    %96 = stablehlo.reshape %95 : (tensor<1x1xf32>) -> tensor<1xf32>
    %97 = stablehlo.broadcast_in_dim %96, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %98 = stablehlo.multiply %88, %97 : tensor<1x4096xf32>
    %99 = stablehlo.reshape %arg192 : (tensor<4096xf32>) -> tensor<1x4096xf32>
    %100 = stablehlo.multiply %98, %99 : tensor<1x4096xf32>
    %101 = stablehlo.transpose %arg206, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %102 = stablehlo.dot %100, %101, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x11008xf32>) -> tensor<1x11008xf32>
    %103 = stablehlo.logistic %102 : tensor<1x11008xf32>
    %104 = stablehlo.multiply %102, %103 : tensor<1x11008xf32>
    %105 = stablehlo.transpose %arg191, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %106 = stablehlo.dot %100, %105, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x11008xf32>) -> tensor<1x11008xf32>
    %107 = stablehlo.multiply %104, %106 : tensor<1x11008xf32>
    %108 = stablehlo.transpose %arg190, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[11008,4096]{0,1}"} : (tensor<4096x11008xf32>) -> tensor<11008x4096xf32>
    %109 = stablehlo.dot %107, %108, precision = [DEFAULT, DEFAULT] : (tensor<1x11008xf32>, tensor<11008x4096xf32>) -> tensor<1x4096xf32>
    %110 = stablehlo.add %88, %109 : tensor<1x4096xf32>
    %111 = stablehlo.power %110, %1 : tensor<1x4096xf32>
    %112 = stablehlo.reduce(%111 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %113 = stablehlo.multiply %112, %0 : tensor<1xf32>
    %114 = stablehlo.reshape %113 : (tensor<1xf32>) -> tensor<1x1xf32>
    %115 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %116 = stablehlo.add %114, %115 : tensor<1x1xf32>
    %117 = stablehlo.rsqrt %116 : tensor<1x1xf32>
    %118 = stablehlo.reshape %117 : (tensor<1x1xf32>) -> tensor<1xf32>
    %119 = stablehlo.broadcast_in_dim %118, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %120 = stablehlo.multiply %110, %119 : tensor<1x4096xf32>
    %121 = stablehlo.reshape %arg189 : (tensor<4096xf32>) -> tensor<1x4096xf32>
    %122 = stablehlo.multiply %120, %121 : tensor<1x4096xf32>
    %123 = stablehlo.transpose %arg210, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %124 = stablehlo.dot %122, %123, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %125 = stablehlo.reshape %124 : (tensor<1x4096xf32>) -> tensor<1x32x64x2xf32>
    %126 = stablehlo.slice %125 [0:1, 0:32, 0:64, 0:1] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %127 = stablehlo.reshape %126 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %128 = stablehlo.slice %125 [0:1, 0:32, 0:64, 1:2] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %129 = stablehlo.reshape %128 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %130 = stablehlo.complex %127, %129 : tensor<1x32x64xcomplex<f32>>
    %131 = stablehlo.broadcast_in_dim %28, dims = [0, 2] : (tensor<1x64xcomplex<f32>>) -> tensor<1x32x64xcomplex<f32>>
    %132 = stablehlo.multiply %130, %131 : tensor<1x32x64xcomplex<f32>>
    %133 = stablehlo.real %132 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %134 = stablehlo.reshape %133 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %135 = stablehlo.imag %132 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %136 = stablehlo.reshape %135 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %137 = stablehlo.concatenate %134, %136, dim = 3 : (tensor<1x32x64x1xf32>, tensor<1x32x64x1xf32>) -> tensor<1x32x64x2xf32>
    %138 = stablehlo.reshape %137 : (tensor<1x32x64x2xf32>) -> tensor<32x1x128xf32>
    %139 = stablehlo.compare  LT, %arg198, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %140 = stablehlo.reshape %arg199 : (tensor<i64>) -> tensor<1xi64>
    %141 = stablehlo.add %arg198, %140 : tensor<1xi64>
    %142 = stablehlo.select %139, %141, %arg198 : tensor<1xi1>, tensor<1xi64>
    %143 = stablehlo.reshape %142 : (tensor<1xi64>) -> tensor<1x1xi64>
    %144 = stablehlo.transpose %arg208, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %145 = stablehlo.dot %122, %144, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %146 = stablehlo.reshape %145 : (tensor<1x4096xf32>) -> tensor<1x32x64x2xf32>
    %147 = stablehlo.slice %146 [0:1, 0:32, 0:64, 0:1] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %148 = stablehlo.reshape %147 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %149 = stablehlo.slice %146 [0:1, 0:32, 0:64, 1:2] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %150 = stablehlo.reshape %149 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %151 = stablehlo.complex %148, %150 : tensor<1x32x64xcomplex<f32>>
    %152 = stablehlo.broadcast_in_dim %28, dims = [0, 2] : (tensor<1x64xcomplex<f32>>) -> tensor<1x32x64xcomplex<f32>>
    %153 = stablehlo.multiply %151, %152 : tensor<1x32x64xcomplex<f32>>
    %154 = stablehlo.real %153 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %155 = stablehlo.reshape %154 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %156 = stablehlo.imag %153 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %157 = stablehlo.reshape %156 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %158 = stablehlo.concatenate %155, %157, dim = 3 : (tensor<1x32x64x1xf32>, tensor<1x32x64x1xf32>) -> tensor<1x32x64x2xf32>
    %159 = stablehlo.reshape %158 : (tensor<1x32x64x2xf32>) -> tensor<1x32x128xf32>
    %160 = "stablehlo.scatter"(%arg209, %143, %159) ({
    ^bb0(%arg362: tensor<f32>, %arg363: tensor<f32>):
      stablehlo.return %arg363 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [1, 2], inserted_window_dims = [0], scatter_dims_to_operand_dims = [0], index_vector_dim = 1>, unique_indices = false} : (tensor<2304x32x128xf32>, tensor<1x1xi64>, tensor<1x32x128xf32>) -> tensor<2304x32x128xf32>
    %161 = stablehlo.convert %arg7 : (tensor<2049xi64>) -> tensor<2049xui32>
    %162 = "stablehlo.gather"(%160, %161) {dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 32, 128]> : tensor<3xi64>} : (tensor<2304x32x128xf32>, tensor<2049xui32>) -> tensor<2049x32x128xf32>
    %163 = stablehlo.transpose %162, dims = [1, 2, 0] : (tensor<2049x32x128xf32>) -> tensor<32x128x2049xf32>
    %164 = stablehlo.dot_general %138, %163, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<32x1x128xf32>, tensor<32x128x2049xf32>) -> tensor<32x1x2049xf32>
    %165 = stablehlo.broadcast_in_dim %arg201, dims = [] : (tensor<f32>) -> tensor<32x1x2049xf32>
    %166 = stablehlo.divide %164, %165 : tensor<32x1x2049xf32>
    %167 = stablehlo.reduce(%166 init: %3) across dimensions = [2] : (tensor<32x1x2049xf32>, tensor<f32>) -> tensor<32x1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.maximum %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %168 = stablehlo.broadcast_in_dim %167, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x2049xf32>
    %169 = stablehlo.subtract %166, %168 : tensor<32x1x2049xf32>
    %170 = stablehlo.exponential %169 : tensor<32x1x2049xf32>
    %171 = stablehlo.reduce(%170 init: %4) across dimensions = [2] : (tensor<32x1x2049xf32>, tensor<f32>) -> tensor<32x1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %172 = stablehlo.broadcast_in_dim %171, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x2049xf32>
    %173 = stablehlo.divide %170, %172 : tensor<32x1x2049xf32>
    %174 = stablehlo.compare  LT, %arg198, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %175 = stablehlo.reshape %arg199 : (tensor<i64>) -> tensor<1xi64>
    %176 = stablehlo.add %arg198, %175 : tensor<1xi64>
    %177 = stablehlo.select %174, %176, %arg198 : tensor<1xi1>, tensor<1xi64>
    %178 = stablehlo.reshape %177 : (tensor<1xi64>) -> tensor<1x1xi64>
    %179 = stablehlo.transpose %arg188, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %180 = stablehlo.dot %122, %179, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %181 = stablehlo.reshape %180 : (tensor<1x4096xf32>) -> tensor<1x32x128xf32>
    %182 = "stablehlo.scatter"(%arg207, %178, %181) ({
    ^bb0(%arg362: tensor<f32>, %arg363: tensor<f32>):
      stablehlo.return %arg363 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [1, 2], inserted_window_dims = [0], scatter_dims_to_operand_dims = [0], index_vector_dim = 1>, unique_indices = false} : (tensor<2304x32x128xf32>, tensor<1x1xi64>, tensor<1x32x128xf32>) -> tensor<2304x32x128xf32>
    %183 = stablehlo.convert %arg7 : (tensor<2049xi64>) -> tensor<2049xui32>
    %184 = "stablehlo.gather"(%182, %183) {dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 32, 128]> : tensor<3xi64>} : (tensor<2304x32x128xf32>, tensor<2049xui32>) -> tensor<2049x32x128xf32>
    %185 = stablehlo.transpose %184, dims = [1, 0, 2] {result_layout = dense<[2, 0, 1]> : tensor<3xindex>, xla_shape = "f32[32,2049,128]{2,0,1}"} : (tensor<2049x32x128xf32>) -> tensor<32x2049x128xf32>
    %186 = stablehlo.dot_general %173, %185, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<32x1x2049xf32>, tensor<32x2049x128xf32>) -> tensor<32x1x128xf32>
    %187 = stablehlo.reshape %186 : (tensor<32x1x128xf32>) -> tensor<1x4096xf32>
    %188 = stablehlo.transpose %arg187, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %189 = stablehlo.dot %187, %188, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %190 = stablehlo.add %110, %189 : tensor<1x4096xf32>
    %191 = stablehlo.power %190, %1 : tensor<1x4096xf32>
    %192 = stablehlo.reduce(%191 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %193 = stablehlo.multiply %192, %0 : tensor<1xf32>
    %194 = stablehlo.reshape %193 : (tensor<1xf32>) -> tensor<1x1xf32>
    %195 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %196 = stablehlo.add %194, %195 : tensor<1x1xf32>
    %197 = stablehlo.rsqrt %196 : tensor<1x1xf32>
    %198 = stablehlo.reshape %197 : (tensor<1x1xf32>) -> tensor<1xf32>
    %199 = stablehlo.broadcast_in_dim %198, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %200 = stablehlo.multiply %190, %199 : tensor<1x4096xf32>
    %201 = stablehlo.reshape %arg186 : (tensor<4096xf32>) -> tensor<1x4096xf32>
    %202 = stablehlo.multiply %200, %201 : tensor<1x4096xf32>
    %203 = stablehlo.transpose %arg211, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %204 = stablehlo.dot %202, %203, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x11008xf32>) -> tensor<1x11008xf32>
    %205 = stablehlo.logistic %204 : tensor<1x11008xf32>
    %206 = stablehlo.multiply %204, %205 : tensor<1x11008xf32>
    %207 = stablehlo.transpose %arg185, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %208 = stablehlo.dot %202, %207, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x11008xf32>) -> tensor<1x11008xf32>
    %209 = stablehlo.multiply %206, %208 : tensor<1x11008xf32>
    %210 = stablehlo.transpose %arg184, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[11008,4096]{0,1}"} : (tensor<4096x11008xf32>) -> tensor<11008x4096xf32>
    %211 = stablehlo.dot %209, %210, precision = [DEFAULT, DEFAULT] : (tensor<1x11008xf32>, tensor<11008x4096xf32>) -> tensor<1x4096xf32>
    %212 = stablehlo.add %190, %211 : tensor<1x4096xf32>
    %213 = stablehlo.power %212, %1 : tensor<1x4096xf32>
    %214 = stablehlo.reduce(%213 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %215 = stablehlo.multiply %214, %0 : tensor<1xf32>
    %216 = stablehlo.reshape %215 : (tensor<1xf32>) -> tensor<1x1xf32>
    %217 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %218 = stablehlo.add %216, %217 : tensor<1x1xf32>
    %219 = stablehlo.rsqrt %218 : tensor<1x1xf32>
    %220 = stablehlo.reshape %219 : (tensor<1x1xf32>) -> tensor<1xf32>
    %221 = stablehlo.broadcast_in_dim %220, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %222 = stablehlo.multiply %212, %221 : tensor<1x4096xf32>
    %223 = stablehlo.reshape %arg183 : (tensor<4096xf32>) -> tensor<1x4096xf32>
    %224 = stablehlo.multiply %222, %223 : tensor<1x4096xf32>
    %225 = stablehlo.transpose %arg215, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %226 = stablehlo.dot %224, %225, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %227 = stablehlo.reshape %226 : (tensor<1x4096xf32>) -> tensor<1x32x64x2xf32>
    %228 = stablehlo.slice %227 [0:1, 0:32, 0:64, 0:1] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %229 = stablehlo.reshape %228 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %230 = stablehlo.slice %227 [0:1, 0:32, 0:64, 1:2] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %231 = stablehlo.reshape %230 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %232 = stablehlo.complex %229, %231 : tensor<1x32x64xcomplex<f32>>
    %233 = stablehlo.broadcast_in_dim %28, dims = [0, 2] : (tensor<1x64xcomplex<f32>>) -> tensor<1x32x64xcomplex<f32>>
    %234 = stablehlo.multiply %232, %233 : tensor<1x32x64xcomplex<f32>>
    %235 = stablehlo.real %234 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %236 = stablehlo.reshape %235 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %237 = stablehlo.imag %234 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %238 = stablehlo.reshape %237 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %239 = stablehlo.concatenate %236, %238, dim = 3 : (tensor<1x32x64x1xf32>, tensor<1x32x64x1xf32>) -> tensor<1x32x64x2xf32>
    %240 = stablehlo.reshape %239 : (tensor<1x32x64x2xf32>) -> tensor<32x1x128xf32>
    %241 = stablehlo.compare  LT, %arg198, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %242 = stablehlo.reshape %arg199 : (tensor<i64>) -> tensor<1xi64>
    %243 = stablehlo.add %arg198, %242 : tensor<1xi64>
    %244 = stablehlo.select %241, %243, %arg198 : tensor<1xi1>, tensor<1xi64>
    %245 = stablehlo.reshape %244 : (tensor<1xi64>) -> tensor<1x1xi64>
    %246 = stablehlo.transpose %arg213, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %247 = stablehlo.dot %224, %246, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %248 = stablehlo.reshape %247 : (tensor<1x4096xf32>) -> tensor<1x32x64x2xf32>
    %249 = stablehlo.slice %248 [0:1, 0:32, 0:64, 0:1] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %250 = stablehlo.reshape %249 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %251 = stablehlo.slice %248 [0:1, 0:32, 0:64, 1:2] : (tensor<1x32x64x2xf32>) -> tensor<1x32x64x1xf32>
    %252 = stablehlo.reshape %251 : (tensor<1x32x64x1xf32>) -> tensor<1x32x64xf32>
    %253 = stablehlo.complex %250, %252 : tensor<1x32x64xcomplex<f32>>
    %254 = stablehlo.broadcast_in_dim %28, dims = [0, 2] : (tensor<1x64xcomplex<f32>>) -> tensor<1x32x64xcomplex<f32>>
    %255 = stablehlo.multiply %253, %254 : tensor<1x32x64xcomplex<f32>>
    %256 = stablehlo.real %255 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %257 = stablehlo.reshape %256 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %258 = stablehlo.imag %255 : (tensor<1x32x64xcomplex<f32>>) -> tensor<1x32x64xf32>
    %259 = stablehlo.reshape %258 : (tensor<1x32x64xf32>) -> tensor<1x32x64x1xf32>
    %260 = stablehlo.concatenate %257, %259, dim = 3 : (tensor<1x32x64x1xf32>, tensor<1x32x64x1xf32>) -> tensor<1x32x64x2xf32>
    %261 = stablehlo.reshape %260 : (tensor<1x32x64x2xf32>) -> tensor<1x32x128xf32>
    %262 = "stablehlo.scatter"(%arg214, %245, %261) ({
    ^bb0(%arg362: tensor<f32>, %arg363: tensor<f32>):
      stablehlo.return %arg363 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [1, 2], inserted_window_dims = [0], scatter_dims_to_operand_dims = [0], index_vector_dim = 1>, unique_indices = false} : (tensor<2304x32x128xf32>, tensor<1x1xi64>, tensor<1x32x128xf32>) -> tensor<2304x32x128xf32>
    %263 = stablehlo.convert %arg7 : (tensor<2049xi64>) -> tensor<2049xui32>
    %264 = "stablehlo.gather"(%262, %263) {dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 32, 128]> : tensor<3xi64>} : (tensor<2304x32x128xf32>, tensor<2049xui32>) -> tensor<2049x32x128xf32>
    %265 = stablehlo.transpose %264, dims = [1, 2, 0] : (tensor<2049x32x128xf32>) -> tensor<32x128x2049xf32>
    %266 = stablehlo.dot_general %240, %265, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<32x1x128xf32>, tensor<32x128x2049xf32>) -> tensor<32x1x2049xf32>
    %267 = stablehlo.broadcast_in_dim %arg201, dims = [] : (tensor<f32>) -> tensor<32x1x2049xf32>
    %268 = stablehlo.divide %266, %267 : tensor<32x1x2049xf32>
    %269 = stablehlo.reduce(%268 init: %3) across dimensions = [2] : (tensor<32x1x2049xf32>, tensor<f32>) -> tensor<32x1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.maximum %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %270 = stablehlo.broadcast_in_dim %269, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x2049xf32>
    %271 = stablehlo.subtract %268, %270 : tensor<32x1x2049xf32>
    %272 = stablehlo.exponential %271 : tensor<32x1x2049xf32>
    %273 = stablehlo.reduce(%272 init: %4) across dimensions = [2] : (tensor<32x1x2049xf32>, tensor<f32>) -> tensor<32x1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %274 = stablehlo.broadcast_in_dim %273, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x2049xf32>
    %275 = stablehlo.divide %272, %274 : tensor<32x1x2049xf32>
    %276 = stablehlo.compare  LT, %arg198, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %277 = stablehlo.reshape %arg199 : (tensor<i64>) -> tensor<1xi64>
    %278 = stablehlo.add %arg198, %277 : tensor<1xi64>
    %279 = stablehlo.select %276, %278, %arg198 : tensor<1xi1>, tensor<1xi64>
    %280 = stablehlo.reshape %279 : (tensor<1xi64>) -> tensor<1x1xi64>
    %281 = stablehlo.transpose %arg182, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %282 = stablehlo.dot %224, %281, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %283 = stablehlo.reshape %282 : (tensor<1x4096xf32>) -> tensor<1x32x128xf32>
    %284 = "stablehlo.scatter"(%arg212, %280, %283) ({
    ^bb0(%arg362: tensor<f32>, %arg363: tensor<f32>):
      stablehlo.return %arg363 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [1, 2], inserted_window_dims = [0], scatter_dims_to_operand_dims = [0], index_vector_dim = 1>, unique_indices = false} : (tensor<2304x32x128xf32>, tensor<1x1xi64>, tensor<1x32x128xf32>) -> tensor<2304x32x128xf32>
    %285 = stablehlo.convert %arg7 : (tensor<2049xi64>) -> tensor<2049xui32>
    %286 = "stablehlo.gather"(%284, %285) {dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 32, 128]> : tensor<3xi64>} : (tensor<2304x32x128xf32>, tensor<2049xui32>) -> tensor<2049x32x128xf32>
    %287 = stablehlo.transpose %286, dims = [1, 0, 2] {result_layout = dense<[2, 0, 1]> : tensor<3xindex>, xla_shape = "f32[32,2049,128]{2,0,1}"} : (tensor<2049x32x128xf32>) -> tensor<32x2049x128xf32>
    %288 = stablehlo.dot_general %275, %287, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<32x1x2049xf32>, tensor<32x2049x128xf32>) -> tensor<32x1x128xf32>
    %289 = stablehlo.reshape %288 : (tensor<32x1x128xf32>) -> tensor<1x4096xf32>
    %290 = stablehlo.transpose %arg181, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %291 = stablehlo.dot %289, %290, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096xf32>
    %292 = stablehlo.add %212, %291 : tensor<1x4096xf32>
    %293 = stablehlo.power %292, %1 : tensor<1x4096xf32>
    %294 = stablehlo.reduce(%293 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %295 = stablehlo.multiply %294, %0 : tensor<1xf32>
    %296 = stablehlo.reshape %295 : (tensor<1xf32>) -> tensor<1x1xf32>
    %297 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %298 = stablehlo.add %296, %297 : tensor<1x1xf32>
    %299 = stablehlo.rsqrt %298 : tensor<1x1xf32>
    %300 = stablehlo.reshape %299 : (tensor<1x1xf32>) -> tensor<1xf32>
    %301 = stablehlo.broadcast_in_dim %300, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %302 = stablehlo.multiply %292, %301 : tensor<1x4096xf32>
    %303 = stablehlo.reshape %arg180 : (tensor<4096xf32>) -> tensor<1x4096xf32>
    %304 = stablehlo.multiply %302, %303 : tensor<1x4096xf32>
    %305 = stablehlo.transpose %arg216, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %306 = stablehlo.dot %304, %305, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x11008xf32>) -> tensor<1x11008xf32>
    %307 = stablehlo.logistic %306 : tensor<1x11008xf32>
    %308 = stablehlo.multiply %306, %307 : tensor<1x11008xf32>
    %309 = stablehlo.transpose %arg179, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %310 = stablehlo.dot %304, %309, precision = [DEFAULT, DEFAULT] : (tensor<1x4096xf32>, tensor<4096x11008xf32>) -> tensor<1x11008xf32>
    %311 = stablehlo.multiply %308, %310 : tensor<1x11008xf32>
    %312 = stablehlo.transpose %arg178, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[11008,4096]{0,1}"} : (tensor<4096x11008xf32>) -> tensor<11008x4096xf32>
    %313 = stablehlo.dot %311, %312, precision = [DEFAULT, DEFAULT] : (tensor<1x11008xf32>, tensor<11008x4096xf32>) -> tensor<1x4096xf32>
    %314 = stablehlo.add %292, %313 : tensor<1x4096xf32>
    %315 = stablehlo.power %314, %1 : tensor<1x4096xf32>
    %316 = stablehlo.reduce(%315 init: %4) across dimensions = [1] : (tensor<1x4096xf32>, tensor<f32>) -> tensor<1xf32>
     reducer(%arg362: tensor<f32>, %arg363: tensor<f32>)  {
      %3287 = stablehlo.add %arg362, %arg363 : tensor<f32>
      stablehlo.return %3287 : tensor<f32>
    }
    %317 = stablehlo.multiply %316, %0 : tensor<1xf32>
    %318 = stablehlo.reshape %317 : (tensor<1xf32>) -> tensor<1x1xf32>
    %319 = stablehlo.reshape %arg2 : (tensor<f32>) -> tensor<1x1xf32>
    %320 = stablehlo.add %318, %319 : tensor<1x1xf32>
    %321 = stablehlo.rsqrt %320 : tensor<1x1xf32>
    %322 = stablehlo.reshape %321 : (tensor<1x1xf32>) -> tensor<1xf32>
    %323 = stablehlo.broadcast_in_dim %322, dims = [0] : (tensor<1xf32>) -> tensor<1x4096xf32>
    %324 = stablehlo.multiply %314, %323 : tensor<1x4096xf32>
