module @IrToHlo.7522 attributes {mhlo.cross_program_prefetches = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<32000x4096xf32>, %arg1: tensor<4096xf32>, %arg2: tensor<f32>, %arg3: tensor<4096x11008xf32>, %arg4: tensor<11008x4096xf32>, %arg5: tensor<4096xf32>, %arg6: tensor<4096x4096xf32>, %arg7: tensor<2048xi64>, %arg8: tensor<4096x4096xf32>, %arg9: tensor<4096xf32>, %arg10: tensor<4096x11008xf32>, %arg11: tensor<11008x4096xf32>, %arg12: tensor<4096xf32>, %arg13: tensor<4096x4096xf32>, %arg14: tensor<4096x4096xf32>, %arg15: tensor<4096xf32>, %arg16: tensor<4096x11008xf32>, %arg17: tensor<11008x4096xf32>, %arg18: tensor<4096xf32>, %arg19: tensor<4096x4096xf32>, %arg20: tensor<4096x4096xf32>, %arg21: tensor<4096xf32>, %arg22: tensor<4096x11008xf32>, %arg23: tensor<11008x4096xf32>, %arg24: tensor<4096xf32>, %arg25: tensor<4096x4096xf32>, %arg26: tensor<4096x4096xf32>, %arg27: tensor<4096xf32>, %arg28: tensor<4096x11008xf32>, %arg29: tensor<11008x4096xf32>, %arg30: tensor<4096xf32>, %arg31: tensor<4096x4096xf32>, %arg32: tensor<4096x4096xf32>, %arg33: tensor<4096xf32>, %arg34: tensor<4096x11008xf32>, %arg35: tensor<11008x4096xf32>, %arg36: tensor<4096xf32>, %arg37: tensor<4096x4096xf32>, %arg38: tensor<4096x4096xf32>, %arg39: tensor<4096xf32>, %arg40: tensor<4096x11008xf32>, %arg41: tensor<11008x4096xf32>, %arg42: tensor<4096xf32>, %arg43: tensor<4096x4096xf32>, %arg44: tensor<4096x4096xf32>, %arg45: tensor<4096xf32>, %arg46: tensor<4096x11008xf32>, %arg47: tensor<11008x4096xf32>, %arg48: tensor<4096xf32>, %arg49: tensor<4096x4096xf32>, %arg50: tensor<4096x4096xf32>, %arg51: tensor<4096xf32>, %arg52: tensor<4096x11008xf32>, %arg53: tensor<11008x4096xf32>, %arg54: tensor<4096xf32>, %arg55: tensor<4096x4096xf32>, %arg56: tensor<4096x4096xf32>, %arg57: tensor<4096xf32>, %arg58: tensor<4096x11008xf32>, %arg59: tensor<11008x4096xf32>, %arg60: tensor<4096xf32>, %arg61: tensor<4096x4096xf32>, %arg62: tensor<4096x4096xf32>, %arg63: tensor<4096xf32>, %arg64: tensor<4096x11008xf32>, %arg65: tensor<11008x4096xf32>, %arg66: tensor<4096xf32>, %arg67: tensor<4096x4096xf32>, %arg68: tensor<4096x4096xf32>, %arg69: tensor<4096xf32>, %arg70: tensor<4096x11008xf32>, %arg71: tensor<11008x4096xf32>, %arg72: tensor<4096xf32>, %arg73: tensor<4096x4096xf32>, %arg74: tensor<4096x4096xf32>, %arg75: tensor<4096xf32>, %arg76: tensor<4096x11008xf32>, %arg77: tensor<11008x4096xf32>, %arg78: tensor<4096xf32>, %arg79: tensor<4096x4096xf32>, %arg80: tensor<4096x4096xf32>, %arg81: tensor<4096xf32>, %arg82: tensor<4096x11008xf32>, %arg83: tensor<11008x4096xf32>, %arg84: tensor<4096xf32>, %arg85: tensor<4096x4096xf32>, %arg86: tensor<4096x4096xf32>, %arg87: tensor<4096xf32>, %arg88: tensor<4096x11008xf32>, %arg89: tensor<11008x4096xf32>, %arg90: tensor<4096xf32>, %arg91: tensor<4096x4096xf32>, %arg92: tensor<4096x4096xf32>, %arg93: tensor<4096xf32>, %arg94: tensor<4096x11008xf32>, %arg95: tensor<11008x4096xf32>, %arg96: tensor<4096xf32>, %arg97: tensor<4096x4096xf32>, %arg98: tensor<4096x4096xf32>, %arg99: tensor<4096xf32>, %arg100: tensor<4096x11008xf32>, %arg101: tensor<11008x4096xf32>, %arg102: tensor<4096xf32>, %arg103: tensor<4096x4096xf32>, %arg104: tensor<4096x4096xf32>, %arg105: tensor<4096xf32>, %arg106: tensor<4096x11008xf32>, %arg107: tensor<11008x4096xf32>, %arg108: tensor<4096xf32>, %arg109: tensor<4096x4096xf32>, %arg110: tensor<4096x4096xf32>, %arg111: tensor<4096xf32>, %arg112: tensor<4096x11008xf32>, %arg113: tensor<11008x4096xf32>, %arg114: tensor<4096xf32>, %arg115: tensor<4096x4096xf32>, %arg116: tensor<4096x4096xf32>, %arg117: tensor<4096xf32>, %arg118: tensor<4096x11008xf32>, %arg119: tensor<11008x4096xf32>, %arg120: tensor<4096xf32>, %arg121: tensor<4096x4096xf32>, %arg122: tensor<4096x4096xf32>, %arg123: tensor<4096xf32>, %arg124: tensor<4096x11008xf32>, %arg125: tensor<11008x4096xf32>, %arg126: tensor<4096xf32>, %arg127: tensor<4096x4096xf32>, %arg128: tensor<4096x4096xf32>, %arg129: tensor<4096xf32>, %arg130: tensor<4096x11008xf32>, %arg131: tensor<11008x4096xf32>, %arg132: tensor<4096xf32>, %arg133: tensor<4096x4096xf32>, %arg134: tensor<4096x4096xf32>, %arg135: tensor<4096xf32>, %arg136: tensor<4096x11008xf32>, %arg137: tensor<11008x4096xf32>, %arg138: tensor<4096xf32>, %arg139: tensor<4096x4096xf32>, %arg140: tensor<4096x4096xf32>, %arg141: tensor<4096xf32>, %arg142: tensor<4096x11008xf32>, %arg143: tensor<11008x4096xf32>, %arg144: tensor<4096xf32>, %arg145: tensor<4096x4096xf32>, %arg146: tensor<4096x4096xf32>, %arg147: tensor<4096xf32>, %arg148: tensor<4096x11008xf32>, %arg149: tensor<11008x4096xf32>, %arg150: tensor<4096xf32>, %arg151: tensor<4096x4096xf32>, %arg152: tensor<4096x4096xf32>, %arg153: tensor<4096xf32>, %arg154: tensor<4096x11008xf32>, %arg155: tensor<11008x4096xf32>, %arg156: tensor<4096xf32>, %arg157: tensor<4096x4096xf32>, %arg158: tensor<4096x4096xf32>, %arg159: tensor<4096xf32>, %arg160: tensor<4096x11008xf32>, %arg161: tensor<11008x4096xf32>, %arg162: tensor<4096xf32>, %arg163: tensor<4096x4096xf32>, %arg164: tensor<4096x4096xf32>, %arg165: tensor<4096xf32>, %arg166: tensor<4096x11008xf32>, %arg167: tensor<11008x4096xf32>, %arg168: tensor<4096xf32>, %arg169: tensor<4096x4096xf32>, %arg170: tensor<4096x4096xf32>, %arg171: tensor<4096xf32>, %arg172: tensor<4096x11008xf32>, %arg173: tensor<11008x4096xf32>, %arg174: tensor<4096xf32>, %arg175: tensor<4096x4096xf32>, %arg176: tensor<4096x4096xf32>, %arg177: tensor<4096xf32>, %arg178: tensor<4096x11008xf32>, %arg179: tensor<11008x4096xf32>, %arg180: tensor<4096xf32>, %arg181: tensor<4096x4096xf32>, %arg182: tensor<4096x4096xf32>, %arg183: tensor<4096xf32>, %arg184: tensor<4096x11008xf32>, %arg185: tensor<11008x4096xf32>, %arg186: tensor<4096xf32>, %arg187: tensor<4096x4096xf32>, %arg188: tensor<4096x4096xf32>, %arg189: tensor<4096xf32>, %arg190: tensor<4096x11008xf32>, %arg191: tensor<11008x4096xf32>, %arg192: tensor<4096xf32>, %arg193: tensor<4096x4096xf32>, %arg194: tensor<4096x4096xf32>, %arg195: tensor<4096xf32>, %arg196: tensor<2x1xi64>, %arg197: tensor<i64>, %arg198: tensor<32000x4096xf32>, %arg199: tensor<1xi64>, %arg200: tensor<i64>, %arg201: tensor<2x2304x32x128xf32>, %arg202: tensor<f32>, %arg203: tensor<4608x64xcomplex<f32>>, %arg204: tensor<4096x4096xf32>, %arg205: tensor<2x2304x32x128xf32>, %arg206: tensor<4096x4096xf32>, %arg207: tensor<11008x4096xf32>, %arg208: tensor<2x2304x32x128xf32>, %arg209: tensor<4096x4096xf32>, %arg210: tensor<2x2304x32x128xf32>, %arg211: tensor<4096x4096xf32>, %arg212: tensor<11008x4096xf32>, %arg213: tensor<2x2304x32x128xf32>, %arg214: tensor<4096x4096xf32>, %arg215: tensor<2x2304x32x128xf32>, %arg216: tensor<4096x4096xf32>, %arg217: tensor<11008x4096xf32>, %arg218: tensor<2x2304x32x128xf32>, %arg219: tensor<4096x4096xf32>, %arg220: tensor<2x2304x32x128xf32>, %arg221: tensor<4096x4096xf32>, %arg222: tensor<11008x4096xf32>, %arg223: tensor<2x2304x32x128xf32>, %arg224: tensor<4096x4096xf32>, %arg225: tensor<2x2304x32x128xf32>, %arg226: tensor<4096x4096xf32>, %arg227: tensor<11008x4096xf32>, %arg228: tensor<2x2304x32x128xf32>, %arg229: tensor<4096x4096xf32>, %arg230: tensor<2x2304x32x128xf32>, %arg231: tensor<4096x4096xf32>, %arg232: tensor<11008x4096xf32>, %arg233: tensor<2x2304x32x128xf32>, %arg234: tensor<4096x4096xf32>, %arg235: tensor<2x2304x32x128xf32>, %arg236: tensor<4096x4096xf32>, %arg237: tensor<11008x4096xf32>, %arg238: tensor<2x2304x32x128xf32>, %arg239: tensor<4096x4096xf32>, %arg240: tensor<2x2304x32x128xf32>, %arg241: tensor<4096x4096xf32>, %arg242: tensor<11008x4096xf32>, %arg243: tensor<2x2304x32x128xf32>, %arg244: tensor<4096x4096xf32>, %arg245: tensor<2x2304x32x128xf32>, %arg246: tensor<4096x4096xf32>, %arg247: tensor<11008x4096xf32>, %arg248: tensor<2x2304x32x128xf32>, %arg249: tensor<4096x4096xf32>, %arg250: tensor<2x2304x32x128xf32>, %arg251: tensor<4096x4096xf32>, %arg252: tensor<11008x4096xf32>, %arg253: tensor<2x2304x32x128xf32>, %arg254: tensor<4096x4096xf32>, %arg255: tensor<2x2304x32x128xf32>, %arg256: tensor<4096x4096xf32>, %arg257: tensor<11008x4096xf32>, %arg258: tensor<2x2304x32x128xf32>, %arg259: tensor<4096x4096xf32>, %arg260: tensor<2x2304x32x128xf32>, %arg261: tensor<4096x4096xf32>, %arg262: tensor<11008x4096xf32>, %arg263: tensor<2x2304x32x128xf32>, %arg264: tensor<4096x4096xf32>, %arg265: tensor<2x2304x32x128xf32>, %arg266: tensor<4096x4096xf32>, %arg267: tensor<11008x4096xf32>, %arg268: tensor<2x2304x32x128xf32>, %arg269: tensor<4096x4096xf32>, %arg270: tensor<2x2304x32x128xf32>, %arg271: tensor<4096x4096xf32>, %arg272: tensor<11008x4096xf32>, %arg273: tensor<2x2304x32x128xf32>, %arg274: tensor<4096x4096xf32>, %arg275: tensor<2x2304x32x128xf32>, %arg276: tensor<4096x4096xf32>, %arg277: tensor<11008x4096xf32>, %arg278: tensor<2x2304x32x128xf32>, %arg279: tensor<4096x4096xf32>, %arg280: tensor<2x2304x32x128xf32>, %arg281: tensor<4096x4096xf32>, %arg282: tensor<11008x4096xf32>, %arg283: tensor<2x2304x32x128xf32>, %arg284: tensor<4096x4096xf32>, %arg285: tensor<2x2304x32x128xf32>, %arg286: tensor<4096x4096xf32>, %arg287: tensor<11008x4096xf32>, %arg288: tensor<2x2304x32x128xf32>, %arg289: tensor<4096x4096xf32>, %arg290: tensor<2x2304x32x128xf32>, %arg291: tensor<4096x4096xf32>, %arg292: tensor<11008x4096xf32>, %arg293: tensor<2x2304x32x128xf32>, %arg294: tensor<4096x4096xf32>, %arg295: tensor<2x2304x32x128xf32>, %arg296: tensor<4096x4096xf32>, %arg297: tensor<11008x4096xf32>, %arg298: tensor<2x2304x32x128xf32>, %arg299: tensor<4096x4096xf32>, %arg300: tensor<2x2304x32x128xf32>, %arg301: tensor<4096x4096xf32>, %arg302: tensor<11008x4096xf32>, %arg303: tensor<2x2304x32x128xf32>, %arg304: tensor<4096x4096xf32>, %arg305: tensor<2x2304x32x128xf32>, %arg306: tensor<4096x4096xf32>, %arg307: tensor<11008x4096xf32>, %arg308: tensor<2x2304x32x128xf32>, %arg309: tensor<4096x4096xf32>, %arg310: tensor<2x2304x32x128xf32>, %arg311: tensor<4096x4096xf32>, %arg312: tensor<11008x4096xf32>, %arg313: tensor<2x2304x32x128xf32>, %arg314: tensor<4096x4096xf32>, %arg315: tensor<2x2304x32x128xf32>, %arg316: tensor<4096x4096xf32>, %arg317: tensor<11008x4096xf32>, %arg318: tensor<2x2304x32x128xf32>, %arg319: tensor<4096x4096xf32>, %arg320: tensor<2x2304x32x128xf32>, %arg321: tensor<4096x4096xf32>, %arg322: tensor<11008x4096xf32>, %arg323: tensor<2x2304x32x128xf32>, %arg324: tensor<4096x4096xf32>, %arg325: tensor<2x2304x32x128xf32>, %arg326: tensor<4096x4096xf32>, %arg327: tensor<11008x4096xf32>, %arg328: tensor<2x2304x32x128xf32>, %arg329: tensor<4096x4096xf32>, %arg330: tensor<2x2304x32x128xf32>, %arg331: tensor<4096x4096xf32>, %arg332: tensor<11008x4096xf32>, %arg333: tensor<2x2304x32x128xf32>, %arg334: tensor<4096x4096xf32>, %arg335: tensor<2x2304x32x128xf32>, %arg336: tensor<4096x4096xf32>, %arg337: tensor<11008x4096xf32>, %arg338: tensor<2x2304x32x128xf32>, %arg339: tensor<4096x4096xf32>, %arg340: tensor<2x2304x32x128xf32>, %arg341: tensor<4096x4096xf32>, %arg342: tensor<11008x4096xf32>, %arg343: tensor<2x2304x32x128xf32>, %arg344: tensor<4096x4096xf32>, %arg345: tensor<2x2304x32x128xf32>, %arg346: tensor<4096x4096xf32>, %arg347: tensor<11008x4096xf32>, %arg348: tensor<2x2304x32x128xf32>, %arg349: tensor<4096x4096xf32>, %arg350: tensor<2x2304x32x128xf32>, %arg351: tensor<4096x4096xf32>, %arg352: tensor<11008x4096xf32>, %arg353: tensor<2x2304x32x128xf32>, %arg354: tensor<4096x4096xf32>, %arg355: tensor<2x2304x32x128xf32>, %arg356: tensor<4096x4096xf32>, %arg357: tensor<11008x4096xf32>, %arg358: tensor<2x2304x32x128xf32>, %arg359: tensor<4096x4096xf32>, %arg360: tensor<2x2304x32x128xf32>, %arg361: tensor<4096x4096xf32>, %arg362: tensor<11008x4096xf32>) -> (tensor<2x1x32000xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>, tensor<2x2304x32x128xf32>) {
    %0 = stablehlo.constant dense<2.44140625E-4> : tensor<2x1xf32>
    %1 = stablehlo.constant dense<2.000000e+00> : tensor<2x1x4096xf32>
    %2 = stablehlo.constant dense<0> : tensor<1xi64>
    %3 = stablehlo.constant dense<0> : tensor<2x1xi64>
    %4 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %5 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %6 = stablehlo.compare  LT, %arg196, %3 : (tensor<2x1xi64>, tensor<2x1xi64>) -> tensor<2x1xi1>
    %7 = stablehlo.reshape %arg197 : (tensor<i64>) -> tensor<1xi64>
    %8 = stablehlo.broadcast_in_dim %7, dims = [1] : (tensor<1xi64>) -> tensor<2x1xi64>
    %9 = stablehlo.add %arg196, %8 : tensor<2x1xi64>
    %10 = stablehlo.select %6, %9, %arg196 : tensor<2x1xi1>, tensor<2x1xi64>
    %11 = stablehlo.reshape %10 : (tensor<2x1xi64>) -> tensor<2x1x1xi64>
    %12 = "stablehlo.gather"(%arg198, %11) {dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = dense<[1, 4096]> : tensor<2xi64>} : (tensor<32000x4096xf32>, tensor<2x1x1xi64>) -> tensor<2x1x4096xf32>
    %13 = stablehlo.power %12, %1 : tensor<2x1x4096xf32>
    %14 = stablehlo.reduce(%13 init: %5) across dimensions = [2] : (tensor<2x1x4096xf32>, tensor<f32>) -> tensor<2x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %15 = stablehlo.multiply %14, %0 : tensor<2x1xf32>
    %16 = stablehlo.reshape %15 : (tensor<2x1xf32>) -> tensor<2x1x1xf32>
    %17 = stablehlo.broadcast_in_dim %arg2, dims = [] : (tensor<f32>) -> tensor<2x1x1xf32>
    %18 = stablehlo.add %16, %17 : tensor<2x1x1xf32>
    %19 = stablehlo.rsqrt %18 : tensor<2x1x1xf32>
    %20 = stablehlo.reshape %19 : (tensor<2x1x1xf32>) -> tensor<2x1xf32>
    %21 = stablehlo.broadcast_in_dim %20, dims = [0, 1] : (tensor<2x1xf32>) -> tensor<2x1x4096xf32>
    %22 = stablehlo.multiply %12, %21 : tensor<2x1x4096xf32>
    %23 = stablehlo.broadcast_in_dim %arg195, dims = [2] : (tensor<4096xf32>) -> tensor<2x1x4096xf32>
    %24 = stablehlo.multiply %22, %23 : tensor<2x1x4096xf32>
    %25 = stablehlo.reshape %24 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %26 = stablehlo.transpose %arg206, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %27 = stablehlo.dot %25, %26, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %28 = stablehlo.reshape %27 : (tensor<2x4096xf32>) -> tensor<2x1x32x64x2xf32>
    %29 = stablehlo.slice %28 [0:2, 0:1, 0:32, 0:64, 0:1] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %30 = stablehlo.reshape %29 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %31 = stablehlo.slice %28 [0:2, 0:1, 0:32, 0:64, 1:2] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %32 = stablehlo.reshape %31 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %33 = stablehlo.complex %30, %32 : tensor<2x1x32x64xcomplex<f32>>
    %34 = stablehlo.convert %arg199 : (tensor<1xi64>) -> tensor<1xui32>
    %35 = "stablehlo.gather"(%arg203, %34) {dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[1, 64]> : tensor<2xi64>} : (tensor<4608x64xcomplex<f32>>, tensor<1xui32>) -> tensor<1x64xcomplex<f32>>
    %36 = stablehlo.broadcast_in_dim %35, dims = [1, 3] : (tensor<1x64xcomplex<f32>>) -> tensor<2x1x32x64xcomplex<f32>>
    %37 = stablehlo.multiply %33, %36 : tensor<2x1x32x64xcomplex<f32>>
    %38 = stablehlo.real %37 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %39 = stablehlo.reshape %38 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %40 = stablehlo.imag %37 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %41 = stablehlo.reshape %40 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %42 = stablehlo.concatenate %39, %41, dim = 4 : (tensor<2x1x32x64x1xf32>, tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64x2xf32>
    %43 = stablehlo.reshape %42 : (tensor<2x1x32x64x2xf32>) -> tensor<64x1x128xf32>
    %44 = stablehlo.compare  LT, %arg199, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %45 = stablehlo.reshape %arg200 : (tensor<i64>) -> tensor<1xi64>
    %46 = stablehlo.add %arg199, %45 : tensor<1xi64>
    %47 = stablehlo.select %44, %46, %arg199 : tensor<1xi1>, tensor<1xi64>
    %48 = stablehlo.reshape %47 : (tensor<1xi64>) -> tensor<1x1xi64>
    %49 = stablehlo.reshape %24 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %50 = stablehlo.transpose %arg204, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %51 = stablehlo.dot %49, %50, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %52 = stablehlo.reshape %51 : (tensor<2x4096xf32>) -> tensor<2x1x32x64x2xf32>
    %53 = stablehlo.slice %52 [0:2, 0:1, 0:32, 0:64, 0:1] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %54 = stablehlo.reshape %53 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %55 = stablehlo.slice %52 [0:2, 0:1, 0:32, 0:64, 1:2] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %56 = stablehlo.reshape %55 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %57 = stablehlo.complex %54, %56 : tensor<2x1x32x64xcomplex<f32>>
    %58 = stablehlo.broadcast_in_dim %35, dims = [1, 3] : (tensor<1x64xcomplex<f32>>) -> tensor<2x1x32x64xcomplex<f32>>
    %59 = stablehlo.multiply %57, %58 : tensor<2x1x32x64xcomplex<f32>>
    %60 = stablehlo.real %59 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %61 = stablehlo.reshape %60 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %62 = stablehlo.imag %59 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %63 = stablehlo.reshape %62 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %64 = stablehlo.concatenate %61, %63, dim = 4 : (tensor<2x1x32x64x1xf32>, tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64x2xf32>
    %65 = stablehlo.reshape %64 : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x128xf32>
    %66 = "stablehlo.scatter"(%arg205, %48, %65) ({
    ^bb0(%arg363: tensor<f32>, %arg364: tensor<f32>):
      stablehlo.return %arg364 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 2, 3], inserted_window_dims = [1], scatter_dims_to_operand_dims = [1], index_vector_dim = 1>, unique_indices = false} : (tensor<2x2304x32x128xf32>, tensor<1x1xi64>, tensor<2x1x32x128xf32>) -> tensor<2x2304x32x128xf32>
    %67 = stablehlo.convert %arg7 : (tensor<2048xi64>) -> tensor<2048xui32>
    %68 = "stablehlo.gather"(%66, %67) {dimension_numbers = #stablehlo.gather<offset_dims = [0, 2, 3], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[2, 1, 32, 128]> : tensor<4xi64>} : (tensor<2x2304x32x128xf32>, tensor<2048xui32>) -> tensor<2x2048x32x128xf32>
    %69 = stablehlo.transpose %68, dims = [0, 2, 3, 1] : (tensor<2x2048x32x128xf32>) -> tensor<2x32x128x2048xf32>
    %70 = stablehlo.reshape %69 : (tensor<2x32x128x2048xf32>) -> tensor<64x128x2048xf32>
    %71 = stablehlo.dot_general %43, %70, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x1x128xf32>, tensor<64x128x2048xf32>) -> tensor<64x1x2048xf32>
    %72 = stablehlo.reshape %71 : (tensor<64x1x2048xf32>) -> tensor<2x32x1x2048xf32>
    %73 = stablehlo.broadcast_in_dim %arg202, dims = [] : (tensor<f32>) -> tensor<2x32x1x2048xf32>
    %74 = stablehlo.divide %72, %73 : tensor<2x32x1x2048xf32>
    %75 = stablehlo.reduce(%74 init: %4) across dimensions = [3] : (tensor<2x32x1x2048xf32>, tensor<f32>) -> tensor<2x32x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.maximum %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %76 = stablehlo.broadcast_in_dim %75, dims = [0, 1, 2] : (tensor<2x32x1xf32>) -> tensor<2x32x1x2048xf32>
    %77 = stablehlo.subtract %74, %76 : tensor<2x32x1x2048xf32>
    %78 = stablehlo.exponential %77 : tensor<2x32x1x2048xf32>
    %79 = stablehlo.reduce(%78 init: %5) across dimensions = [3] : (tensor<2x32x1x2048xf32>, tensor<f32>) -> tensor<2x32x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %80 = stablehlo.broadcast_in_dim %79, dims = [0, 1, 2] : (tensor<2x32x1xf32>) -> tensor<2x32x1x2048xf32>
    %81 = stablehlo.divide %78, %80 : tensor<2x32x1x2048xf32>
    %82 = stablehlo.reshape %81 : (tensor<2x32x1x2048xf32>) -> tensor<64x1x2048xf32>
    %83 = stablehlo.compare  LT, %arg199, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %84 = stablehlo.reshape %arg200 : (tensor<i64>) -> tensor<1xi64>
    %85 = stablehlo.add %arg199, %84 : tensor<1xi64>
    %86 = stablehlo.select %83, %85, %arg199 : tensor<1xi1>, tensor<1xi64>
    %87 = stablehlo.reshape %86 : (tensor<1xi64>) -> tensor<1x1xi64>
    %88 = stablehlo.reshape %24 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %89 = stablehlo.transpose %arg194, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %90 = stablehlo.dot %88, %89, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %91 = stablehlo.reshape %90 : (tensor<2x4096xf32>) -> tensor<2x1x32x128xf32>
    %92 = "stablehlo.scatter"(%arg201, %87, %91) ({
    ^bb0(%arg363: tensor<f32>, %arg364: tensor<f32>):
      stablehlo.return %arg364 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 2, 3], inserted_window_dims = [1], scatter_dims_to_operand_dims = [1], index_vector_dim = 1>, unique_indices = false} : (tensor<2x2304x32x128xf32>, tensor<1x1xi64>, tensor<2x1x32x128xf32>) -> tensor<2x2304x32x128xf32>
    %93 = stablehlo.convert %arg7 : (tensor<2048xi64>) -> tensor<2048xui32>
    %94 = "stablehlo.gather"(%92, %93) {dimension_numbers = #stablehlo.gather<offset_dims = [0, 2, 3], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[2, 1, 32, 128]> : tensor<4xi64>} : (tensor<2x2304x32x128xf32>, tensor<2048xui32>) -> tensor<2x2048x32x128xf32>
    %95 = stablehlo.transpose %94, dims = [0, 2, 1, 3] {result_layout = dense<[3, 1, 2, 0]> : tensor<4xindex>, xla_shape = "f32[2,32,2048,128]{3,1,2,0}"} : (tensor<2x2048x32x128xf32>) -> tensor<2x32x2048x128xf32>
    %96 = stablehlo.reshape %95 : (tensor<2x32x2048x128xf32>) -> tensor<64x2048x128xf32>
    %97 = stablehlo.dot_general %82, %96, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x1x2048xf32>, tensor<64x2048x128xf32>) -> tensor<64x1x128xf32>
    %98 = stablehlo.reshape %97 : (tensor<64x1x128xf32>) -> tensor<2x4096xf32>
    %99 = stablehlo.transpose %arg193, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %100 = stablehlo.dot %98, %99, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %101 = stablehlo.reshape %100 : (tensor<2x4096xf32>) -> tensor<2x1x4096xf32>
    %102 = stablehlo.add %12, %101 : tensor<2x1x4096xf32>
    %103 = stablehlo.power %102, %1 : tensor<2x1x4096xf32>
    %104 = stablehlo.reduce(%103 init: %5) across dimensions = [2] : (tensor<2x1x4096xf32>, tensor<f32>) -> tensor<2x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %105 = stablehlo.multiply %104, %0 : tensor<2x1xf32>
    %106 = stablehlo.reshape %105 : (tensor<2x1xf32>) -> tensor<2x1x1xf32>
    %107 = stablehlo.broadcast_in_dim %arg2, dims = [] : (tensor<f32>) -> tensor<2x1x1xf32>
    %108 = stablehlo.add %106, %107 : tensor<2x1x1xf32>
    %109 = stablehlo.rsqrt %108 : tensor<2x1x1xf32>
    %110 = stablehlo.reshape %109 : (tensor<2x1x1xf32>) -> tensor<2x1xf32>
    %111 = stablehlo.broadcast_in_dim %110, dims = [0, 1] : (tensor<2x1xf32>) -> tensor<2x1x4096xf32>
    %112 = stablehlo.multiply %102, %111 : tensor<2x1x4096xf32>
    %113 = stablehlo.broadcast_in_dim %arg192, dims = [2] : (tensor<4096xf32>) -> tensor<2x1x4096xf32>
    %114 = stablehlo.multiply %112, %113 : tensor<2x1x4096xf32>
    %115 = stablehlo.reshape %114 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %116 = stablehlo.transpose %arg207, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %117 = stablehlo.dot %115, %116, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x11008xf32>) -> tensor<2x11008xf32>
    %118 = stablehlo.reshape %117 : (tensor<2x11008xf32>) -> tensor<2x1x11008xf32>
    %119 = stablehlo.logistic %118 : tensor<2x1x11008xf32>
    %120 = stablehlo.multiply %118, %119 : tensor<2x1x11008xf32>
    %121 = stablehlo.reshape %114 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %122 = stablehlo.transpose %arg191, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %123 = stablehlo.dot %121, %122, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x11008xf32>) -> tensor<2x11008xf32>
    %124 = stablehlo.reshape %123 : (tensor<2x11008xf32>) -> tensor<2x1x11008xf32>
    %125 = stablehlo.multiply %120, %124 : tensor<2x1x11008xf32>
    %126 = stablehlo.reshape %125 : (tensor<2x1x11008xf32>) -> tensor<2x11008xf32>
    %127 = stablehlo.transpose %arg190, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[11008,4096]{0,1}"} : (tensor<4096x11008xf32>) -> tensor<11008x4096xf32>
    %128 = stablehlo.dot %126, %127, precision = [DEFAULT, DEFAULT] : (tensor<2x11008xf32>, tensor<11008x4096xf32>) -> tensor<2x4096xf32>
    %129 = stablehlo.reshape %128 : (tensor<2x4096xf32>) -> tensor<2x1x4096xf32>
    %130 = stablehlo.add %102, %129 : tensor<2x1x4096xf32>
    %131 = stablehlo.power %130, %1 : tensor<2x1x4096xf32>
    %132 = stablehlo.reduce(%131 init: %5) across dimensions = [2] : (tensor<2x1x4096xf32>, tensor<f32>) -> tensor<2x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %133 = stablehlo.multiply %132, %0 : tensor<2x1xf32>
    %134 = stablehlo.reshape %133 : (tensor<2x1xf32>) -> tensor<2x1x1xf32>
    %135 = stablehlo.broadcast_in_dim %arg2, dims = [] : (tensor<f32>) -> tensor<2x1x1xf32>
    %136 = stablehlo.add %134, %135 : tensor<2x1x1xf32>
    %137 = stablehlo.rsqrt %136 : tensor<2x1x1xf32>
    %138 = stablehlo.reshape %137 : (tensor<2x1x1xf32>) -> tensor<2x1xf32>
    %139 = stablehlo.broadcast_in_dim %138, dims = [0, 1] : (tensor<2x1xf32>) -> tensor<2x1x4096xf32>
    %140 = stablehlo.multiply %130, %139 : tensor<2x1x4096xf32>
    %141 = stablehlo.broadcast_in_dim %arg189, dims = [2] : (tensor<4096xf32>) -> tensor<2x1x4096xf32>
    %142 = stablehlo.multiply %140, %141 : tensor<2x1x4096xf32>
    %143 = stablehlo.reshape %142 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %144 = stablehlo.transpose %arg211, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %145 = stablehlo.dot %143, %144, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %146 = stablehlo.reshape %145 : (tensor<2x4096xf32>) -> tensor<2x1x32x64x2xf32>
    %147 = stablehlo.slice %146 [0:2, 0:1, 0:32, 0:64, 0:1] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %148 = stablehlo.reshape %147 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %149 = stablehlo.slice %146 [0:2, 0:1, 0:32, 0:64, 1:2] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %150 = stablehlo.reshape %149 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %151 = stablehlo.complex %148, %150 : tensor<2x1x32x64xcomplex<f32>>
    %152 = stablehlo.broadcast_in_dim %35, dims = [1, 3] : (tensor<1x64xcomplex<f32>>) -> tensor<2x1x32x64xcomplex<f32>>
    %153 = stablehlo.multiply %151, %152 : tensor<2x1x32x64xcomplex<f32>>
    %154 = stablehlo.real %153 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %155 = stablehlo.reshape %154 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %156 = stablehlo.imag %153 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %157 = stablehlo.reshape %156 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %158 = stablehlo.concatenate %155, %157, dim = 4 : (tensor<2x1x32x64x1xf32>, tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64x2xf32>
    %159 = stablehlo.reshape %158 : (tensor<2x1x32x64x2xf32>) -> tensor<64x1x128xf32>
    %160 = stablehlo.compare  LT, %arg199, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %161 = stablehlo.reshape %arg200 : (tensor<i64>) -> tensor<1xi64>
    %162 = stablehlo.add %arg199, %161 : tensor<1xi64>
    %163 = stablehlo.select %160, %162, %arg199 : tensor<1xi1>, tensor<1xi64>
    %164 = stablehlo.reshape %163 : (tensor<1xi64>) -> tensor<1x1xi64>
    %165 = stablehlo.reshape %142 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %166 = stablehlo.transpose %arg209, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %167 = stablehlo.dot %165, %166, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %168 = stablehlo.reshape %167 : (tensor<2x4096xf32>) -> tensor<2x1x32x64x2xf32>
    %169 = stablehlo.slice %168 [0:2, 0:1, 0:32, 0:64, 0:1] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %170 = stablehlo.reshape %169 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %171 = stablehlo.slice %168 [0:2, 0:1, 0:32, 0:64, 1:2] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %172 = stablehlo.reshape %171 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %173 = stablehlo.complex %170, %172 : tensor<2x1x32x64xcomplex<f32>>
    %174 = stablehlo.broadcast_in_dim %35, dims = [1, 3] : (tensor<1x64xcomplex<f32>>) -> tensor<2x1x32x64xcomplex<f32>>
    %175 = stablehlo.multiply %173, %174 : tensor<2x1x32x64xcomplex<f32>>
    %176 = stablehlo.real %175 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %177 = stablehlo.reshape %176 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %178 = stablehlo.imag %175 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %179 = stablehlo.reshape %178 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %180 = stablehlo.concatenate %177, %179, dim = 4 : (tensor<2x1x32x64x1xf32>, tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64x2xf32>
    %181 = stablehlo.reshape %180 : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x128xf32>
    %182 = "stablehlo.scatter"(%arg210, %164, %181) ({
    ^bb0(%arg363: tensor<f32>, %arg364: tensor<f32>):
      stablehlo.return %arg364 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 2, 3], inserted_window_dims = [1], scatter_dims_to_operand_dims = [1], index_vector_dim = 1>, unique_indices = false} : (tensor<2x2304x32x128xf32>, tensor<1x1xi64>, tensor<2x1x32x128xf32>) -> tensor<2x2304x32x128xf32>
    %183 = stablehlo.convert %arg7 : (tensor<2048xi64>) -> tensor<2048xui32>
    %184 = "stablehlo.gather"(%182, %183) {dimension_numbers = #stablehlo.gather<offset_dims = [0, 2, 3], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[2, 1, 32, 128]> : tensor<4xi64>} : (tensor<2x2304x32x128xf32>, tensor<2048xui32>) -> tensor<2x2048x32x128xf32>
    %185 = stablehlo.transpose %184, dims = [0, 2, 3, 1] : (tensor<2x2048x32x128xf32>) -> tensor<2x32x128x2048xf32>
    %186 = stablehlo.reshape %185 : (tensor<2x32x128x2048xf32>) -> tensor<64x128x2048xf32>
    %187 = stablehlo.dot_general %159, %186, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x1x128xf32>, tensor<64x128x2048xf32>) -> tensor<64x1x2048xf32>
    %188 = stablehlo.reshape %187 : (tensor<64x1x2048xf32>) -> tensor<2x32x1x2048xf32>
    %189 = stablehlo.broadcast_in_dim %arg202, dims = [] : (tensor<f32>) -> tensor<2x32x1x2048xf32>
    %190 = stablehlo.divide %188, %189 : tensor<2x32x1x2048xf32>
    %191 = stablehlo.reduce(%190 init: %4) across dimensions = [3] : (tensor<2x32x1x2048xf32>, tensor<f32>) -> tensor<2x32x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.maximum %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %192 = stablehlo.broadcast_in_dim %191, dims = [0, 1, 2] : (tensor<2x32x1xf32>) -> tensor<2x32x1x2048xf32>
    %193 = stablehlo.subtract %190, %192 : tensor<2x32x1x2048xf32>
    %194 = stablehlo.exponential %193 : tensor<2x32x1x2048xf32>
    %195 = stablehlo.reduce(%194 init: %5) across dimensions = [3] : (tensor<2x32x1x2048xf32>, tensor<f32>) -> tensor<2x32x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %196 = stablehlo.broadcast_in_dim %195, dims = [0, 1, 2] : (tensor<2x32x1xf32>) -> tensor<2x32x1x2048xf32>
    %197 = stablehlo.divide %194, %196 : tensor<2x32x1x2048xf32>
    %198 = stablehlo.reshape %197 : (tensor<2x32x1x2048xf32>) -> tensor<64x1x2048xf32>
    %199 = stablehlo.compare  LT, %arg199, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %200 = stablehlo.reshape %arg200 : (tensor<i64>) -> tensor<1xi64>
    %201 = stablehlo.add %arg199, %200 : tensor<1xi64>
    %202 = stablehlo.select %199, %201, %arg199 : tensor<1xi1>, tensor<1xi64>
    %203 = stablehlo.reshape %202 : (tensor<1xi64>) -> tensor<1x1xi64>
    %204 = stablehlo.reshape %142 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %205 = stablehlo.transpose %arg188, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %206 = stablehlo.dot %204, %205, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %207 = stablehlo.reshape %206 : (tensor<2x4096xf32>) -> tensor<2x1x32x128xf32>
    %208 = "stablehlo.scatter"(%arg208, %203, %207) ({
    ^bb0(%arg363: tensor<f32>, %arg364: tensor<f32>):
      stablehlo.return %arg364 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 2, 3], inserted_window_dims = [1], scatter_dims_to_operand_dims = [1], index_vector_dim = 1>, unique_indices = false} : (tensor<2x2304x32x128xf32>, tensor<1x1xi64>, tensor<2x1x32x128xf32>) -> tensor<2x2304x32x128xf32>
    %209 = stablehlo.convert %arg7 : (tensor<2048xi64>) -> tensor<2048xui32>
    %210 = "stablehlo.gather"(%208, %209) {dimension_numbers = #stablehlo.gather<offset_dims = [0, 2, 3], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[2, 1, 32, 128]> : tensor<4xi64>} : (tensor<2x2304x32x128xf32>, tensor<2048xui32>) -> tensor<2x2048x32x128xf32>
    %211 = stablehlo.transpose %210, dims = [0, 2, 1, 3] {result_layout = dense<[3, 1, 2, 0]> : tensor<4xindex>, xla_shape = "f32[2,32,2048,128]{3,1,2,0}"} : (tensor<2x2048x32x128xf32>) -> tensor<2x32x2048x128xf32>
    %212 = stablehlo.reshape %211 : (tensor<2x32x2048x128xf32>) -> tensor<64x2048x128xf32>
    %213 = stablehlo.dot_general %198, %212, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x1x2048xf32>, tensor<64x2048x128xf32>) -> tensor<64x1x128xf32>
    %214 = stablehlo.reshape %213 : (tensor<64x1x128xf32>) -> tensor<2x4096xf32>
    %215 = stablehlo.transpose %arg187, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %216 = stablehlo.dot %214, %215, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %217 = stablehlo.reshape %216 : (tensor<2x4096xf32>) -> tensor<2x1x4096xf32>
    %218 = stablehlo.add %130, %217 : tensor<2x1x4096xf32>
    %219 = stablehlo.power %218, %1 : tensor<2x1x4096xf32>
    %220 = stablehlo.reduce(%219 init: %5) across dimensions = [2] : (tensor<2x1x4096xf32>, tensor<f32>) -> tensor<2x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %221 = stablehlo.multiply %220, %0 : tensor<2x1xf32>
    %222 = stablehlo.reshape %221 : (tensor<2x1xf32>) -> tensor<2x1x1xf32>
    %223 = stablehlo.broadcast_in_dim %arg2, dims = [] : (tensor<f32>) -> tensor<2x1x1xf32>
    %224 = stablehlo.add %222, %223 : tensor<2x1x1xf32>
    %225 = stablehlo.rsqrt %224 : tensor<2x1x1xf32>
    %226 = stablehlo.reshape %225 : (tensor<2x1x1xf32>) -> tensor<2x1xf32>
    %227 = stablehlo.broadcast_in_dim %226, dims = [0, 1] : (tensor<2x1xf32>) -> tensor<2x1x4096xf32>
    %228 = stablehlo.multiply %218, %227 : tensor<2x1x4096xf32>
    %229 = stablehlo.broadcast_in_dim %arg186, dims = [2] : (tensor<4096xf32>) -> tensor<2x1x4096xf32>
    %230 = stablehlo.multiply %228, %229 : tensor<2x1x4096xf32>
    %231 = stablehlo.reshape %230 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %232 = stablehlo.transpose %arg212, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %233 = stablehlo.dot %231, %232, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x11008xf32>) -> tensor<2x11008xf32>
    %234 = stablehlo.reshape %233 : (tensor<2x11008xf32>) -> tensor<2x1x11008xf32>
    %235 = stablehlo.logistic %234 : tensor<2x1x11008xf32>
    %236 = stablehlo.multiply %234, %235 : tensor<2x1x11008xf32>
    %237 = stablehlo.reshape %230 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %238 = stablehlo.transpose %arg185, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,11008]{0,1}"} : (tensor<11008x4096xf32>) -> tensor<4096x11008xf32>
    %239 = stablehlo.dot %237, %238, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x11008xf32>) -> tensor<2x11008xf32>
    %240 = stablehlo.reshape %239 : (tensor<2x11008xf32>) -> tensor<2x1x11008xf32>
    %241 = stablehlo.multiply %236, %240 : tensor<2x1x11008xf32>
    %242 = stablehlo.reshape %241 : (tensor<2x1x11008xf32>) -> tensor<2x11008xf32>
    %243 = stablehlo.transpose %arg184, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[11008,4096]{0,1}"} : (tensor<4096x11008xf32>) -> tensor<11008x4096xf32>
    %244 = stablehlo.dot %242, %243, precision = [DEFAULT, DEFAULT] : (tensor<2x11008xf32>, tensor<11008x4096xf32>) -> tensor<2x4096xf32>
    %245 = stablehlo.reshape %244 : (tensor<2x4096xf32>) -> tensor<2x1x4096xf32>
    %246 = stablehlo.add %218, %245 : tensor<2x1x4096xf32>
    %247 = stablehlo.power %246, %1 : tensor<2x1x4096xf32>
    %248 = stablehlo.reduce(%247 init: %5) across dimensions = [2] : (tensor<2x1x4096xf32>, tensor<f32>) -> tensor<2x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %249 = stablehlo.multiply %248, %0 : tensor<2x1xf32>
    %250 = stablehlo.reshape %249 : (tensor<2x1xf32>) -> tensor<2x1x1xf32>
    %251 = stablehlo.broadcast_in_dim %arg2, dims = [] : (tensor<f32>) -> tensor<2x1x1xf32>
    %252 = stablehlo.add %250, %251 : tensor<2x1x1xf32>
    %253 = stablehlo.rsqrt %252 : tensor<2x1x1xf32>
    %254 = stablehlo.reshape %253 : (tensor<2x1x1xf32>) -> tensor<2x1xf32>
    %255 = stablehlo.broadcast_in_dim %254, dims = [0, 1] : (tensor<2x1xf32>) -> tensor<2x1x4096xf32>
    %256 = stablehlo.multiply %246, %255 : tensor<2x1x4096xf32>
    %257 = stablehlo.broadcast_in_dim %arg183, dims = [2] : (tensor<4096xf32>) -> tensor<2x1x4096xf32>
    %258 = stablehlo.multiply %256, %257 : tensor<2x1x4096xf32>
    %259 = stablehlo.reshape %258 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %260 = stablehlo.transpose %arg216, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %261 = stablehlo.dot %259, %260, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %262 = stablehlo.reshape %261 : (tensor<2x4096xf32>) -> tensor<2x1x32x64x2xf32>
    %263 = stablehlo.slice %262 [0:2, 0:1, 0:32, 0:64, 0:1] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %264 = stablehlo.reshape %263 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %265 = stablehlo.slice %262 [0:2, 0:1, 0:32, 0:64, 1:2] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %266 = stablehlo.reshape %265 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %267 = stablehlo.complex %264, %266 : tensor<2x1x32x64xcomplex<f32>>
    %268 = stablehlo.broadcast_in_dim %35, dims = [1, 3] : (tensor<1x64xcomplex<f32>>) -> tensor<2x1x32x64xcomplex<f32>>
    %269 = stablehlo.multiply %267, %268 : tensor<2x1x32x64xcomplex<f32>>
    %270 = stablehlo.real %269 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %271 = stablehlo.reshape %270 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %272 = stablehlo.imag %269 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %273 = stablehlo.reshape %272 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %274 = stablehlo.concatenate %271, %273, dim = 4 : (tensor<2x1x32x64x1xf32>, tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64x2xf32>
    %275 = stablehlo.reshape %274 : (tensor<2x1x32x64x2xf32>) -> tensor<64x1x128xf32>
    %276 = stablehlo.compare  LT, %arg199, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %277 = stablehlo.reshape %arg200 : (tensor<i64>) -> tensor<1xi64>
    %278 = stablehlo.add %arg199, %277 : tensor<1xi64>
    %279 = stablehlo.select %276, %278, %arg199 : tensor<1xi1>, tensor<1xi64>
    %280 = stablehlo.reshape %279 : (tensor<1xi64>) -> tensor<1x1xi64>
    %281 = stablehlo.reshape %258 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %282 = stablehlo.transpose %arg214, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %283 = stablehlo.dot %281, %282, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %284 = stablehlo.reshape %283 : (tensor<2x4096xf32>) -> tensor<2x1x32x64x2xf32>
    %285 = stablehlo.slice %284 [0:2, 0:1, 0:32, 0:64, 0:1] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %286 = stablehlo.reshape %285 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %287 = stablehlo.slice %284 [0:2, 0:1, 0:32, 0:64, 1:2] : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x64x1xf32>
    %288 = stablehlo.reshape %287 : (tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64xf32>
    %289 = stablehlo.complex %286, %288 : tensor<2x1x32x64xcomplex<f32>>
    %290 = stablehlo.broadcast_in_dim %35, dims = [1, 3] : (tensor<1x64xcomplex<f32>>) -> tensor<2x1x32x64xcomplex<f32>>
    %291 = stablehlo.multiply %289, %290 : tensor<2x1x32x64xcomplex<f32>>
    %292 = stablehlo.real %291 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %293 = stablehlo.reshape %292 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %294 = stablehlo.imag %291 : (tensor<2x1x32x64xcomplex<f32>>) -> tensor<2x1x32x64xf32>
    %295 = stablehlo.reshape %294 : (tensor<2x1x32x64xf32>) -> tensor<2x1x32x64x1xf32>
    %296 = stablehlo.concatenate %293, %295, dim = 4 : (tensor<2x1x32x64x1xf32>, tensor<2x1x32x64x1xf32>) -> tensor<2x1x32x64x2xf32>
    %297 = stablehlo.reshape %296 : (tensor<2x1x32x64x2xf32>) -> tensor<2x1x32x128xf32>
    %298 = "stablehlo.scatter"(%arg215, %280, %297) ({
    ^bb0(%arg363: tensor<f32>, %arg364: tensor<f32>):
      stablehlo.return %arg364 : tensor<f32>
    }) {indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 2, 3], inserted_window_dims = [1], scatter_dims_to_operand_dims = [1], index_vector_dim = 1>, unique_indices = false} : (tensor<2x2304x32x128xf32>, tensor<1x1xi64>, tensor<2x1x32x128xf32>) -> tensor<2x2304x32x128xf32>
    %299 = stablehlo.convert %arg7 : (tensor<2048xi64>) -> tensor<2048xui32>
    %300 = "stablehlo.gather"(%298, %299) {dimension_numbers = #stablehlo.gather<offset_dims = [0, 2, 3], collapsed_slice_dims = [1], start_index_map = [1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = dense<[2, 1, 32, 128]> : tensor<4xi64>} : (tensor<2x2304x32x128xf32>, tensor<2048xui32>) -> tensor<2x2048x32x128xf32>
    %301 = stablehlo.transpose %300, dims = [0, 2, 3, 1] : (tensor<2x2048x32x128xf32>) -> tensor<2x32x128x2048xf32>
    %302 = stablehlo.reshape %301 : (tensor<2x32x128x2048xf32>) -> tensor<64x128x2048xf32>
    %303 = stablehlo.dot_general %275, %302, batching_dims = [0] x [0], contracting_dims = [2] x [1], precision = [DEFAULT, DEFAULT] : (tensor<64x1x128xf32>, tensor<64x128x2048xf32>) -> tensor<64x1x2048xf32>
    %304 = stablehlo.reshape %303 : (tensor<64x1x2048xf32>) -> tensor<2x32x1x2048xf32>
    %305 = stablehlo.broadcast_in_dim %arg202, dims = [] : (tensor<f32>) -> tensor<2x32x1x2048xf32>
    %306 = stablehlo.divide %304, %305 : tensor<2x32x1x2048xf32>
    %307 = stablehlo.reduce(%306 init: %4) across dimensions = [3] : (tensor<2x32x1x2048xf32>, tensor<f32>) -> tensor<2x32x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.maximum %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %308 = stablehlo.broadcast_in_dim %307, dims = [0, 1, 2] : (tensor<2x32x1xf32>) -> tensor<2x32x1x2048xf32>
    %309 = stablehlo.subtract %306, %308 : tensor<2x32x1x2048xf32>
    %310 = stablehlo.exponential %309 : tensor<2x32x1x2048xf32>
    %311 = stablehlo.reduce(%310 init: %5) across dimensions = [3] : (tensor<2x32x1x2048xf32>, tensor<f32>) -> tensor<2x32x1xf32>
     reducer(%arg363: tensor<f32>, %arg364: tensor<f32>)  {
      %3743 = stablehlo.add %arg363, %arg364 : tensor<f32>
      stablehlo.return %3743 : tensor<f32>
    }
    %312 = stablehlo.broadcast_in_dim %311, dims = [0, 1, 2] : (tensor<2x32x1xf32>) -> tensor<2x32x1x2048xf32>
    %313 = stablehlo.divide %310, %312 : tensor<2x32x1x2048xf32>
    %314 = stablehlo.reshape %313 : (tensor<2x32x1x2048xf32>) -> tensor<64x1x2048xf32>
    %315 = stablehlo.compare  LT, %arg199, %2 : (tensor<1xi64>, tensor<1xi64>) -> tensor<1xi1>
    %316 = stablehlo.reshape %arg200 : (tensor<i64>) -> tensor<1xi64>
    %317 = stablehlo.add %arg199, %316 : tensor<1xi64>
    %318 = stablehlo.select %315, %317, %arg199 : tensor<1xi1>, tensor<1xi64>
    %319 = stablehlo.reshape %318 : (tensor<1xi64>) -> tensor<1x1xi64>
    %320 = stablehlo.reshape %258 : (tensor<2x1x4096xf32>) -> tensor<2x4096xf32>
    %321 = stablehlo.transpose %arg182, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "f32[4096,4096]{0,1}"} : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %322 = stablehlo.dot %320, %321, precision = [DEFAULT, DEFAULT] : (tensor<2x4096xf32>, tensor<4096x4096xf32>) -> tensor<2x4096xf32>
    %323 = stablehlo.reshape %322 : (tensor<2x4096xf32>) -> tensor<2x1x32x128xf32>
    %324 = "stablehlo.scatter"(%arg213, %319, %323) ({
    ^bb0(%arg363: tensor<f32>, %arg364: tensor<f32>):
      stablehlo.return %arg364 : tensor<f32>
